[About Language File]
Comments=اذا وجدت خطا في الترجمة اعلمني لاصلحه محدث الترجمة فتحي الداودية
Date=25.06.2022
Email=lalalogitech@hotmail.com
Version=23.1.0

[AboutDialog]
Caption=&Text Editor Pro حول
LabelCopyright=الحقوق %s.كلها محفوظة.
LabelFeedback=Feedback
LabelIcons=الايقونات
LabelLanguageFileContributors=المساهمون في الترجمة
LabelLicense=هذا المنتج هو دائما مجانا بالنسبة لك. انظر الرحصة
LabelMemoryAvailable=الذاكرة المتاحة للوندوز: %s
LabelThirdPartyComponents=3rd مكونات المجموعة
LabelVersion=الاصدار %s (%d-bit)
LabelWebsite=الموقع

[AskYesOrNo]
CancelSearch=الغاء البحث, هل انت متاكد?
CheckInternationalCharacters:=Translation needed
CheckInternationalCharacters=File "%s" contains international characters.%sChange the encoding to keep the characters.%sSave anyway?
CloseDirectory=غلق المجلد %s,هل انت متاكد?
DeleteDirectory=حذف المجلد %s, هل انت متاكد?
DeleteFile=حذف الملف %s, هل انت متاكد?
DeleteLine=حذف الخط, هل انت متاكد?
NewVersion=اصدار جديد  %s of %sمتوفر.%sهل تريد تحميله من الانترنت?
RecordMacro=تسجيل اختصار جديد, هل انت متاكد?
ReopenFileWithEncoding=اعد فتح الملف "%s" التشفير?
ReplaceOccurence=استبدال هذا الملف المعطوب "%s"?
ResetColor=اعادة تعيين %s لون ، هل انت متاكد?
SaveChanges=حفظ التغييرات?
SearchMatchNotFound=لم يتم ايجاد بحث مطابق.%sاعد البحث من بداية الملف?
SearchStringNotFound=سلسلة البحث "%s" غير موجودة

[ChangedFilesDialog]
Caption=اعادة تحميل الملفات التي تم تغييرها
VirtualDrawTree:0=الملف
VirtualDrawTree:1=المسار

[ClipboardHistoryDialog]
ActionClearAll=مسح الكل
ActionCopyToClipboard=نسخ الى الحافظة
ActionInsertInEditor=ادراج في محرر
Caption=سجل الحافظة

[ColorConstant]
SColorBoxCustomCaption=تخصيص...
SName3DDkShadow=ظل 3 الابعاد قاتم
SName3DLight=ضوء3 الابعاد
SNameActiveBorder=حدود نشطة
SNameActiveCaption=التعليق النشط
SNameAppWorkSpace=مساحة عمل التطبيق
SNameAqua=مائي
SNameBackground=الخلفية
SNameBlack=اسود
SNameBlue=ازرق
SNameBtnFace=وجه الزر
SNameBtnHighlight=تمييز الزر
SNameBtnShadow=ظل زر
SNameBtnText=زر كتابة
SNameCaptionText=نص الشرح
SNameCream=كريم
SNameDefault=&افتراضي
SNameFuchsia=ارجواني
SNameGradientActiveCaption=التدرج التوضيحي النشط
SNameGradientInactiveCaption=التدرج التوضيحي غير النشط
SNameGray=رمادي
SNameGrayText=نص رمادي
SNameGreen=اخضر
SNameHighlight=تمييز الخلفية
SNameHighlightText=تمييزالنص
SNameHotLight=ضوء نشط
SNameInactiveBorder=حد غير نشط
SNameInactiveCaption=تعليق غير نشط
SNameInactiveCaptionText=نص التعليق غير النشط
SNameInfoBk=خلفية المعلومات
SNameInfoText=نص المعلومات
SNameLime=ليموني
SNameMaroon=كستنائي
SNameMedGray=رمادي متوسط
SNameMenu=خلفية القائمة
SNameMenuBar=شريط القوائم
SNameMenuHighlight=تمييز القائمة
SNameMenuText=نص القائمة
SNameMoneyGreen=المال الخضراء
SNameNavy=بحري
SNameNone=لاشئ
SNameOlive=زيتوني
SNamePurple=ارجواني
SNameRed=احمر
SNameScrollBar=شريط التمرير
SNameSilver=فضة
SNameSkyBlue=ازرق سماوي
SNameTeal=بطي
SNameWhite=ابيض
SNameWindow=خلفية النافذة
SNameWindowFrame=اطار النافذة
SNameWindowText=نص النافذة
SNameYellow=اصفر

[CompareForm]
ActionExit:h=خروج من مقارنة النص
ActionExit=خروج
ActionLeftCopy:h=انسخ الخط الحالي الى الملف الصحيح
ActionLeftCopy=نسخ
ActionLeftFileOpen:h=فتح ملف موجود
ActionLeftFileOpen=فتح
ActionLeftFileSave:h=حفظ الملف
ActionLeftFileSave=حفظ
ActionLeftNext:h=الانتقال الى الفرق التالي
ActionLeftNext:s=F3
ActionLeftNext=&التالي
ActionLeftPrevious:h=الانتقال الى الفرق السابق
ActionLeftPrevious:s=Shift+F3
ActionLeftPrevious=السابق
ActionLeftReload:h=اعادة تحميل الملف الحالي
ActionLeftReload=اعادة تحميل
ActionLeftSwap:h=تبديل الخط الحالي بالملف الصحيح
ActionLeftSwap=مبادلة
ActionOptions:h=خيارات مقارنه النص
ActionOptions=الخيارات
ActionRightCopy:h=انسخ السطر الحالي الى الملف الايسر
ActionRightCopy=نسخ
ActionRightFileOpen:h=افتح ملف موجود
ActionRightFileOpen=فتح
ActionRightFileSave:h=حفظ الملف
ActionRightFileSave=حفظ
ActionRightNext:h=الانتقال الى الفرق التالي
ActionRightNext:s=F4
ActionRightNext=&التالي
ActionRightPrevious:h=الانتقال الى الفرق السابق
ActionRightPrevious:s=Shift+F4
ActionRightPrevious=&السابق
ActionRightReload:h=اعادة تحميل الملف الحالي
ActionRightReload=اعادة تحميل
ActionRightSwap:h=تبديل الخط الحالي مع الملف الايسر
ActionRightSwap=مبادلة
ActionSearchFindPrevious:h=&اوجد السابق
ActionSearchFindPrevious:s=Shift+Ctrl+F3
ActionSearchFindNext:h=&اوجد التالي
ActionSearchFindNext:s=Ctrl+F3
ActionSearchMatchCase:h=حساسية الموضوع
ActionSearchMatchCase=حساسية الموضوع
ActionSearchWholeWords:h=الكلمة الكاملة فقط
ActionSearchWholeWords=الكلمة الكاملة فقط
ActionSearchClose:h=اغلاق
Caption=مقارنة النص

[CompareOptionsDialog]
Caption=خيارات مقارنه النص
CheckBoxIgnoreBlanks=تجاهل الفراغات
CheckBoxIgnoreCase=تجاهل الكشف
CheckBoxShowSpecialChars=اظهر رموز خاصة
ComboBoxColorTheme=الوان

[ConfirmReplaceDialog]
Caption=تاكيد التغيير

[Constant]
Active=&نشط
ActualSize=الحجم الأصلي 
AddFile:t=Translation needed
AddFile=Add file
AllFiles=كل الملفات
Arrow=المؤشر
AutoSave=حفظ تلقائي
Block=منع
Blue:t=Translation needed
Blue=Blue
Bookmark=العلامة
Bookmarks=قوائم العناوين
Bottom=الاسفل
Bytes=بايت
CharacterCount=عدد الاحرف
Circle=دائرة
Color=لون
CompareFiles=موازنة الملفات
Confirmation=التاكيد
Connecting=التوصيل 
CountingFiles=احصاء الملفات...
Dash=شرطه 
Default=افتراضي
DirectoryItems=مواد المجلد
DocumentIsValid=المستند صالح.
Dot=نقطة
DoubleUnderline=تسطير مزدوج
Download=تحميل
DownloadCancelling=يتم الالغاء...
DownloadDone=انجز.
EditDirectory=تعديل المجلد
Encoding=&التشفير
Enter=دخول
Error=خطا
Extended=تمديد - \n, \t, \0
FavouriteItems=العناصر المفضلة
FileMaskItems=مواد الملف الخفية
FilesFound=%d ملفات تم ايجادها في %s
FitHeight=ارتفاع ملائم
FitWidth=عرض ملائم
Gigabyte=ق ب
GoToBookmark=اذهب الى المرجعية
GoToLine=انتقل الى السطر
Green:t=Translation needed
Green=Green
HalfBlock=الكتلة النصفية
Hide=اخفاء
Highlighter=المميز
HorizontalLine=خط افقي
Hovered=تارجح
Inactive=غير نشط
Information=معلومات
Insert=ادخال
InsertTags=ادخال HTML/XML اشارات
Installer=التركيب
InvalidName=اسم غير صالح
Keyword=الكلمه الاساسيه
Kilobyte=كيلوبايت
LanguageEditor=محرر اللغة - %s
Left=يسار
Length=الطول
Line=سطر
LineCount=عدد الاسطر
LoadingFile=تحميل الملف...
LoadingFiles=تحميل ملفات...
LoadingOutput=جارٍ تحميل المخرجات ...
LowerCase=حالة أقل
MatchFound=%dمطابق%s وجد
MatchFoundPluralExtension=es
Megabyte=م.ب
Memory=الذاكرة
Minute=دق
Modified=تم التعديل
NewFolder=مجلد جديد
NoChange=لا تغيير
None=لاشئ
Normal=عادي
OccurencesFound=%d محطم تم ايجاده في %s
Open=افتح
OpenDirectory=افتح مجلد
Overwrite=كتابة
Page=صفحة
Password=كلمة المرور
Pilcrow=Pilcrow
PleaseWait=انتظر من فضلك
Position=الموقع: %d
PreviewFilePage=الصفحة: $PAGENUM$ من $PAGECOUNT$
PreviewPage=الصفحة: %d of %d
PreviewPrintFile=طبع (%s)|طبع المستند على %s
PrintedBy=تمت طباعته بواسطة %s
ProcessingFile=معالجة الملف...
Purple:t=Translation needed
Purple=Purple
ReadOnly=القراءة فقط
Red:t=Translation needed
Red=Red
RegularExpression=تعبير قياسي
Rename=هل تريد اعادة تسمية "%s" to "%s"?
RenameFailed=%s فشلت اعادة التسمية
RenameTab:t=Translation needed
RenameTab=Rename tab
ReopenItems=اعد فتح المواد
Results=النتائج
Right=يمين
RightMargin=الهامش الايمن
SaveAs=حفظ باسم
Search=البحث
SearchFor=ابحث عن "%s"
SearchItems=مواد البحث
Second=ثانية
SelectRootDirectory=تحديد مجلد الجذر
SelectWorkingDirectory=حدد دليل العمل
SentenceCase=حالة الجملة
Separator=الفاصل
ShowOnlyInList=إظهار فقط في القائمة
Snippet=مقتطف
Solid=صلب
Speed=السرعة
Square=مربع
Text=نص
TextToFindItems=اكتب لايجاد مواد
ThinHorizontalLine=سطر افقي رفيع
ThinVerticalLine=سطر عمودي رفيع
ToggleBookmark=تبديل الاشارة المرجعية
Top=اعلى
TopLine=خط اعلى: %d
Triangle=مثلث
Underline=تسطير
Untitled=معنونه
UpperCase=الأحرف الكبيرة
UseOnAllHighlighters=استخدمه على جميع أقلام التحديد
VersionInfoNotFound=معلموات الاصدار غير موجودة.
VerticalLine=سطر عمودي
Warning=تحذير
WaveLine=خط الموجة
WavyZigzag=متعرج متموج
Width=العرض
Wildcard=البدل - *, ?, #
WordCount=عدد الكلمات
Yellow:t=Translation needed
Yellow=Yellow 
ZipPackage=الحزمة البريدية

[ConvertConstant]
AcreFeet=قدم هكتار
AcreInches=بوصة هكتار
Acres=الهكتار
Angstroms=الانغستروم
Area=منطقه
Ares=هكتار
AstronomicalUnits=الوحدات الفلكية
Binary=ثنائي
Celsius=مئوي
Centares=سنتي هكتار
Centigrams=سينتغرام
CentiLiters=سنتيلتر
Centimeters=سنتيمتر
Centuries=قرون
Chains=السلاسل
CordFeet=قدم وتري
Cords=الاوتار
CubicCentimeters=سنتيمتر مكعب
CubicDecameters=ديكامتر مكعب
CubicDecimeters=ديسيمتر مكعب
CubicFeet=قدم مكعب
CubicHectometers=هيكتومتر مكعب
CubicInches=بوصة مكعبة
CubicKilometers=كيلومتر مكعب
CubicMeters=متر مكعب
CubicMiles=ميل مكعب
CubicMillimeters=مليمتير مكعب
CubicYards=ياردة مكعبة
Cubits=المقياس
DateTime=التاريخ
Days=ايام
Decades=عقود
Decagrams=ديكاغرام
DecaLiters=ديكالتر
Decameters=ديكامتر
Decasteres=المنكسرات
Decigrams=ديسيغرام
DeciLiters=ديسيلتر
Decimal=عشري
Decimeters=ديسيمتر
Decisteres=القرارات
Distance=المسافة
Drams=درام
DryBuckets=دلاء جافة
DryBushels=بوشل جاف
DryGallons=جالونات جافة
DryPecks=البقع الجافة
DryPints=مكاييل جافة
DryQuarts=الكوارتات الجافة
Fahrenheit=فهرنهايت
Fathoms=القامات
Feet=قدم
FluidCups=اكواب السوائل
FluidGallons=غالون السوائل
FluidGills=خياشيم السوائل
FluidOunces=اوقية السوائل
FluidPints=مكملات السوائل
FluidQuarts=السوائل الكوارتات
FluidTablespoons=ملاعق السوائل
FluidTeaspoons=ملعقة سوائل صغيرة
Fortnights=اسبوعين
Furlongs=الفرلنغ
Gigameters=غيغامتر
Grains=الحبوب
Grams=غرام
Hands=يد
Hectares=هكتارات
Hectograms=هيكتوغرام
HectoLiters=هيكتولتر
Hectometers=هكتامتر
Hexadecimal=عشري
Hours=ساعات
Inches=بوصة
JulianDate=تاريخ جولياني
Kelvin=كلفن
Kilograms=كيلوغرام
KiloLiters=كيلولتر
Kilometers=كيلومتر
LightYears=سنة ضوئية
Links=الروابط
Liters=لتر
LongTons=الطن الطويل
Mass=الكتلة
Megameters=ميغامتر
Meters=متر
MetricTons=الطن المتري
Micrograms=مايكروغرام
Micromicrons=الميكرونات الدقيقة
Microns=ميكرون
Miles=ميل
Millennia=الالفية
Milligrams=ميليغرام
MilliLiters=مليلتر
Millimeters=مليمتر
Millimicrons=ميلي ميكرون
MilliSeconds=ملي ثانية
Minutes=دقائق
ModifiedJulianDate=تعديل تاريخ جولياني
Months=شهور
Nanograms=نانوغرام
NauticalMiles=ميل بحري
NumeralSystem=النظام الرقمي
Ounces=اونصة
Paces=الخطوات
Parsecs=برسيكس
Picas=الحروف المطبعية
Points=النقاط
Pounds=رطل
Rankine=Rankine
Reaumur=Reaumur
Rods=القضبان
Seconds=ثواني
SquareCentimeters=سنتيمتر مربع
SquareDecameters=ديكامتر مربع
SquareDecimeters=ديسيمتر مربع
SquareFeet=قدم مربعة
SquareHectometers=هيكتومترمربع
SquareInches=بوصة مربعة
SquareKilometers=كيلومتر مربع
SquareMeters=متر مربع
SquareMiles=ميل مربع
SquareMillimeters=مليمتر مربع
SquareRods=قضبان مربعة
SquareYards=ياردة مربعة
Steres=ستير متر مكعب
Stones=الحجارة
Temperature=درجة الحرارة
Time=الوقت
Tons=الطن
UKBuckets=دلاء بريطاني
UKBushels=مكيال للحبوب البريطاني
UKGallons=الغالونات البريطانية
UKGill=الخياشيم البريطانية
UKOunces=الاونصة البريطانية
UKPecks=مقياس الجفاف البريطانية
UKPints=نصف لتر بريطاني
UKPottle=نصف غالون البريطانية
UKQuarts=الكوارتات البريطانية
Weeks=اسابيع
Volume=الحجم
Yards=ياردة
Years=سنوات

[ConvertForm]
Caption=تحويل بين الوحدات الرقمية
ComboBoxFrom=من
ComboBoxTo=الى
ComboBoxType=النوع
EditResult=النتيجة
EditValue=القيمة

[DialogConstant]
SMsgDlgAbort=&احباط
SMsgDlgAll=&الكل
SMsgDlgCancel=الغاء الامر
SMsgDlgClose=&اغلاق
SMsgDlgConfirm=تاكيد
SMsgDlgError=خطا
SMsgDlgHelp=&التعليمات
SMsgDlgHelpHelp=التعليمات
SMsgDlgHelpNone=لاتوجد تعليمات متوفرة
SMsgDlgIgnore=&تجاهل
SMsgDlgInformation=معلومات
SMsgDlgNo=&لا
SMsgDlgNoToAll=&لا للكل
SMsgDlgOK=موافق
SMsgDlgRetry=&اعد المحاولة
SMsgDlgWarning=تحذير
SMsgDlgYes=&نعم
SMsgDlgYesToAll=نعم &للكل
SNoMappingForUnicodeCharacter=لا يوجد اي تخطيط لحرف Unicode في صفحة الاكواد المستهدفة متعددة البايت

[DirectoryTabDialog]
CheckBoxExcludeOtherDirectoryBranches=تضمين فروع المجلد الاخرى
ComboBoxDrives=التعاريف
ComboBoxFileMask=الملف المخفي
EditRootDirectory=مجلد الجذر
EditTabName=اسم التبويب
GroupBoxOptions=الاختيارات

[DownloadURLDialog]
ActionCancel=الغاء الامر
ActionOK=&موافق
Caption=تحميل

[EditorColorElements]
ActiveLineBackground=خلفية السطر النشط
ActiveLineBackgroundUnfocused=Active line background unfocused
ActiveLineForeground=مقدمة السطر النشط
ActiveLineForegroundUnfocused=خط المقدمة النشطة غير مركزة
Background=خلفية
CodeFoldingActiveLineBackground=رمز للطي خلفية خط نشط
CodeFoldingActiveLineBackgroundUnfocused=طي الكود خلفية الخط النشط غير مركزة
CodeFoldingBackground=خلفية طي الكود
CodeFoldingCollapsedLine=خط مطوي طي الشفرة
CodeFoldingFoldingLine=كود للطي طي الخط
CodeFoldingFoldingLineHighlight=رمز للطي خط للطي مميز
CodeFoldingHintBackground=قانون للطي تلميح الخلفية
CodeFoldingHintBorder=رمز تلميح للطي الحدود
CodeFoldingHintIndicatorBackground=رمز خلفية مؤشر تلميح للطي
CodeFoldingHintIndicatorBorder=حدود مؤشر تلميح رمز الطي
CodeFoldingHintIndicatorMark=رمز مؤشر علامة تلميح للطي
CodeFoldingHintText=نص تلميح قانون للطي
CodeFoldingIndent=رمز المسافة البادئة
CodeFoldingIndentHighlight=رمز المسافة البادئة للطي قابلة للطي
CompletionProposalBackground=خلفية اقتراح الاكمال
CompletionProposalForeground=اقتراح الانتهاء من المقدمة
CompletionProposalSelectedBackground=اقتراح الانتهاء مختارة الخلفية
CompletionProposalSelectedText=اقتراح انهاء النص المحدد
LeftMarginActiveLineBackground=خلفية خط الهامش الايسر
LeftMarginActiveLineBackgroundUnfocused=الهامش الأيسر خلفية الخط النشط غير مركزة
LeftMarginActiveLineNumber=Left margin active line number
LeftMarginBackground=خلفية الهامش الايسر
LeftMarginBookmarkPanel=لوحة اشارة الهامش الايسر
LeftMarginBorder=حدود الهامش الايسر
LeftMarginLineNumberLine=خط رقم خط الهامش الايسر
LeftMarginLineNumbers=ارقام خط الهامش الايسر
LeftMarginLineStateModified=تم تعديل حالة خط الهامش الايسر
LeftMarginLineStateNormal=حالة خط الهامش الايسر عادية
MatchingPairMatched=مطابقه ثنائي متطابق
MatchingPairUnmatched=مطابقه ثنائي لا مثيل لها
MinimapBackground=خلفيه الخريطة المصغرة
MinimapBookmark=خريطة مصغرة المرجعية
MinimapVisibleLines=الخطوط المرئية للخريطة المصغرة
RightMargin=الهامش الايمن
RightMovingEdge=الحافة المتحركة اليمنى
RulerBackground=خلفيه المسطرة
RulerBorder=حدود المساطر
RulerLines=خطوط المسطرة
RulerMovingEdge=حافه مسطره متحركة
RulerNumbers=ارقام المسطرة
RulerSelection=اختيار المسطرة
SearchHighlighterBackground=بحث عن خلفية التمييز
SearchHighlighterBorder=بحث عن حدود قلم التمييز
SearchHighlighterForeground=بحث عن قلم التمييز
SearchInSelectionBackground=البحث في خلفية الاختيار
SearchMapActiveLine=خريطة البحث خط نشط
SearchMapBackground=بحث خريطة الخلفية
SearchMapForeground=ابحث في خريطة المقدمة
SelectionBackground=خلفية الاختيار
SelectionForeground=اختيار المقدمة
SyncEditBackground=مزامنة تحرير الخلفية
SyncEditEditBorder=تزامن تحرير تحرير الحدود
SyncEditWordBorder=تزامن تحرير كلمة الحدود
WordWrapIndicatorArrow=كلمة مؤشر التفاف السهم
WordWrapIndicatorLines=خطوط مؤشر التفاف الكلمة

[ErrorMessage]
DefaultEmailProgramNotFound=لا يمكن العثور على برنامج لارسال البريد الالكتروني
DirectoryNotExist=غير موجود "%s" دليل
EnterFilename=أدخل اسم الملف.
EnterKeyword=أدخل الكلمة المفتاحية.
EnterPath=ادخل المسار.
EnterServer=أدخل الخادم.
EnterTabName=ادخل اسم التبويب.
FileNotFound=الملف "%s" غير موجود.
RootDirectoryNotExist=مجلد الجذر غير موجود.

[ExecuteDialog]
ActionDelete:h=حذف مادة
ActionDelete=حذف
ActionEdit:h=تعديل مادة
ActionEdit=تصحيح
ActionInsert:h=ادخال مادة
ActionInsert=ادخال
ActionMoveDown:h=حرك المواد المحددة الى الاسفل
ActionMoveDown=تحريك للاسفل
ActionMoveUp:h=حرك المواد المحددة الى الاعلى
ActionMoveUp=تحريك للاعلى
ActionSort:h=فرز المواد
ActionSort=فرز
Caption=تنفيذ المواد

[ExecuteEditDialog]
Caption=تنفيذ البند
CheckBoxSaveActiveFile=حفظ الملف النشط
CheckBoxShowOutput=إظهار الإخراج
ComboBoxShortcut=اختصار
EditFilename=اسم الملف
EditParameters=المعلمات
EditTitle=عنوان
EditWorkingDirectory=عمل اخراجي

[FilesSelectDialog]
ActionSelectAll:h=حدد كل الملفات
ActionSelectAll=تحديد الكل
ActionUnselectAll:h=الغاء تحديد كل الملفات
ActionUnselectAll=الغاء تحديد الكل
Caption=حدد الملفات
VirtualDrawTree:0=الملف
VirtualDrawTree:1=المسار

[FileTypes]
7Zip=7-Zip ملفات مضغوطة (*.7z)|*.7z
ABAP=ملفات ABAP (*.abap)
ActionScript=ملفات ActionScript (*.as)
ASP=ملفات ASP (*.asp)
Assembler - 6502=ملفات 6502 Assembler (*.asm)
Assembler - 68HC11=ملفات 68HC11 Assembler (*.hc11;*.asc)
AutoHotkey=ملفات AutoHotkey (*.ahk)
AutoIt v3=ملفات AutoIt (*.au3)
AWK=ملفات AWK scripts (*.awk)
Bash=ملفات Bash (*.sh)
C#=ملفات C# (*.cs)
C++=ملفات C++ (*.cpp;*.hpp)
C=ملفات C (*.c;*.h)
Clojure=ملفات Clojure (*.clj;*.cljs;*.cljc;*.edn)
CoffeeScript=ملفات CoffeeScript (*.coffee)
CSS=ملفات Cascading Stylesheet (*.css)
D=ملفات D (*.d;*.di)
Dart=ملفات Dart (*.dart)
Delphi Form Module=ملفات Delphi Form Module (*.dfm)
Diff=ملفات Difference (*.diff)
DWScript=ملفات DWScript (*.dws)
Eiffel=ملفات Eiffel (*.e;*.es)
Elixir=ملفات Elixir (*.exs)
Elm=ملفات Elm (*.elm)
Erlang=ملفات Erlang (*.erl;*.hrl)
Euphoria=ملفات Euphoria (*.e;*.ex;*.exw;*.edb)
Exe=الملفات القابلة للتنفيذ (*.exe)|*.exe
F#=ملفات F# (*.fs)
Free Pascal=ملفات Free Pascal (*.pp)
FreeBASIC=ملفات FreeBASIC (*.bi;*.bas)
GDScript=ملفات GDScript (*.gd)
Git Ignore=ملفات Git Ignore (*.gitignore)
GLSL=ملفات GLSL (*.glsl)
Go=ملفات Go (*.go)
Gravity=ملفات Gravity (*.gravity)
Groovy=ملفات Groovy (*.groovy;*.gvy;*.gy;*.gsh)
HTML with Scripts=ملفات HTML (*.html;*.htm)
INI=ملفات INI (*.ini;*.lng)
Inno Setup=ملفات Inno Setup (*.iss)
Java=ملفات Java (*.java)
JavaScript=ملفات JavaScript (*.js)
JSON=ملفات JSON (*.json)
Julia=ملفات Julia (*.jl)
Kotlin=ملفات Kotlin (*.kt;*.kts)
Language=ملفات اللغة (*.lng)|*.lng
LaTex=ملفات LaTex (*.lat;*.tex;*.lex)
Lisp=ملفات Lisp (*.lisp)
Log file=ملفات Log (*.log)
Lua=ملفات Lua (*.lua)
Macro=ملفات الماكرو (*.mcr)|*.mcr
Markdown=ملفات Markdown (*.md)
MATLAB=ملفات MATLAB (*.matlab)
MIME=ملفات MIME (*.eml;*.mht)
MS-DOS Batch=ملفات MS-DOS Batch (*.bat;*.cmd)
MSI=ملفات MSI (*.msi)
NSIS=ملفات NSIS (*.nsi)
Object Pascal=ملفات Pascal (*.pas;*.dpr;*.dpk)
Objective-C=ملفات Objective-C (*.m)
OCaml=ملفات OCaml (*.ml)
PDF=ملفات PDF (*.pdf)
Perl=ملفات Perl (*.pl;*.pm;*.cgi)
PHP=ملفات PHP (*.php;*.class;*.inc)
PowerShell=ملفات PowerShell (*.ps1)
Python=ملفات Python (*.py)
R=ملفات R (*.r;*.rdata;*.rds;*.rda)
Red=ملفات Red (*.red;*.reds)
Ruby=ملفات Ruby (*.rb;*.rbw)
Rust=ملفات Rust (*.rc)
Scala=ملفات Scala (*.scala)
SQL - Standard=ملفات SQL (*.sql)
Structured Text=ملفات Structured Text (*.st; *.iecst)
Swift=ملفات Swift (*.swift)
TclTk=ملفات Tcl/Tk (*.tcl)
Text=ملفات نصية (*.txt)
TypeScript=ملفات TypeScript (*.ts)
UnrealScript=ملفات UnrealScript (*.uc)
Visual Basic=ملفات Visual Basic (*.vb;*.bas)
Visual FoxPro=ملفات Visual FoxPro (*.pjx;*.prg)
VRCalc++=ملفات VRCalc++ (*.vrc;*.vrcm)
XML=ملفات XML (*.xml;*.xsd;*.csl;*.dtd;*.dproj;*.groupproj;*.opml;*.rdf;*.svg;*.wxs)
XSL=ملفات XSL (*.xsl;*.xslt)
YAML=ملفات YAML (*.yml)
Zip=Zip ملفات مضغوطة (*.zip)|*.zip

[FindDuplicatesDialog]
ActionDirectoryItems=مواد المجلد...
ActionFileMaskItems=مواد الملف الخفية...
Caption=البحث عن التكرارات
CheckBoxIgnoreBlanks=تجاهل الفراغات
CheckBoxIgnoreCase=تجاهل الكشف
CheckBoxIncludeSubdirectories=تضمين مجلدات فرعية
CheckBoxScanHorizontally=الفحص افقيا
CheckBoxScanVertically=الفحص عموديا
ComboBoxDirectories=مجلد
ComboBoxFileMask=ملف مخفي
GroupBoxOptions=الخيارات
GroupBoxSearch=البحث
GroupBoxSearchDirectoryOptions=البحث في خيارات الدليل
RadioButtonSearchAllOpenFiles=ابحث في كل الملفات المفتوحة
RadioButtonSearchInDirectories=البحث في الدلائل
SpinEditMinimumBlockSize=الحد الادنى لحجم الكتلة
SpinEditMinimumCharacters=الحد الادنى من الحروف

[FindInFilesDialog]
ActionDirectoryItems=مواد المجلد...
ActionFileMaskItems=مواد الملف الخفية...
ActionSearchEngine=حدد محرك البحث
ActionTextToFindItems=كتب لايجاد مواد...
Caption=اوجد في الملف
CheckBoxDisplayResultsInSeparateTab=عرض النتائج في علامة تبويب منفصلة
CheckBoxGroupResultsByFile=نتائج المجموعة حسب الملف
CheckBoxIncludeSubdirectories=تضمين مجلدات فرعية
CheckBoxMatchCase=اكتشاف حالة الاحرف
CheckBoxShowOnlyResult=إظهار النتيجة فقط
CheckBoxWholeWords=الكلمة الكاملة فقط
ComboBoxDirectories:h=يتم فصل دلائل متعددة بفاصلة منقوطة
ComboBoxDirectories=مجلد
ComboBoxFileMask=ملف مخفي
ComboBoxTextToFind=نص لايجاد
GroupBoxOptions=الاختيارات
GroupBoxOutputOptions=النتيجة
GroupBoxSearch=البحث
GroupBoxSearchDirectoryOptions=ابحث في خيارات المجلد
RadioButtonSearchAllOpenFiles=ابحث في كل الملفات المفتوحة
RadioButtonSearchInCurrentFile:t=Translation needed
RadioButtonSearchInCurrentFile=In current file
RadioButtonSearchInDirectories=البحث في الدلائل

[HighlighterColorElements]
AssemblerComment=تعليق المجمع
AssemblerReservedWord=كلمة المجمّع المحجوزة
Attribute=السمة
Character=حرف
Comment=تعليق
Directive=توجيهات
Editor=محرر
HexNumber=رقم سداسي
HighlightedBlock=كتلة مميزة
HighlightedBlockSymbol:t=Translation needed
HighlightedBlockSymbol=Highlighted block symbol
LogicalOperator:t=Translation needed
LogicalOperator=Logical operator
Method:t=Translation needed
Method=Method
MethodItalic:t=Translation needed
MethodItalic=Method italic
MethodName:t=Translation needed
MethodName=Method name
Number=رقم
ReservedWord=كلمة محجوزة
String=سلسله
Symbol=رمز
Value:t=Translation needed
Value=Value
WebLink:t=Translation needed
WebLink=Web link

[HighlighterFontElements]
CodeFoldingHint=تلميح رمز للطي
CompletionProposal=اقتراح الاكمال
LineNumbers=ارقام الاسطر
Minimap=مصغره
Ruler=مسطرة
Text=نص

[InformationDialog]
Caption=معلومات
LabelAccessed=الوصول
LabelCharacterCount=عدد الرموز
LabelCreated=انشاء
LabelFilename=اسم الملف
LabelLength=الطول
LabelLineCount=عدد الخطوط
LabelLocation=موقعك
LabelModified=تم التعديل
LabelSize=حجم
LabelSizeOnDisk=الحجم على القرص
LabelWordCount=sعدد الكلمات

[Buttons]
ButtonCancel=الغاء الامر
ButtonDonations=المتبرعون
ButtonDownloadAllSkins=تحميل كل الاغلفة
ButtonLicense=الرخصة مطلوبة
ButtonNo=&لا
ButtonOK=&موافق
ButtonYes=&نعم
ButtonYesToAll=نعم &للكل

[ItemListDialog]
ActionClearAll:h=مسح كل المواد
ActionClearAll=مسح الكل
ActionDelete:h=حذف مادة
ActionDelete=حذف
ActionInsert:h=ادخال مادة
ActionInsert=ادخال
ActionMoveDown:h=حرك المواد المحددة الى الاسفل
ActionMoveDown=تحريك للاسفل
ActionMoveUp:h=حرك المواد المحددة الى الاعلى
ActionMoveUp=تحرك للاعلى
ActionSort:h=فرز المواد
ActionSort=فرز

[LanguageEditorForm]
ActionExit:h=اغلاق محرر اللغة
ActionExit=خروج
ActionFileNew:h=انشاء ملف لغة جديد
ActionFileNew=جديد
ActionFileOpen:h=فتح ملف صيغة اللغة
ActionFileOpen=فتح
ActionFileSave:h=حفظ ملف اللغة
ActionFileSave=حفظ
VirtualDrawTree:0=الوظيفة
VirtualDrawTree:1=الشرح
VirtualDrawTree:2=المعلومة
VirtualDrawTree:3=الاختصار
VirtualDrawTree:4=اختصار ثانوي

[MainForm]
ActionBookmarkListShowFilters:t=Translation needed
ActionBookmarkListShowFilters=Show filters
ActionDirectoryContextMenu:h=قائمة المحتويات
ActionDirectoryContextMenu=&قائمة المحتويات
ActionDirectoryDelete:h=حذف الملف او المجلد
ActionDirectoryDelete=&حذف
ActionDirectoryFileExplorer:h=فتح ملف المستكشف
ActionDirectoryFileExplorer=مستكشف الملفات
ActionDirectoryFindInFiles:h=ابحث عن سلسلة في الملفات المتعددة
ActionDirectoryFindInFiles=&اوجد داخل الملفات...
ActionDirectoryNewFolder=مجلد جديد
ActionDirectoryOpenAllFiles:h=افتح كل الملفات من الدليل
ActionDirectoryOpenAllFiles=افتح كل الملفات
ActionDirectoryOpenFileExplorer:h=فتح ملف المستكشف
ActionDirectoryOpenFileExplorer=مستكشف الملفات
ActionDirectoryProperties:h=شاهد خصائص الملف او المجلد
ActionDirectoryProperties=&الخصائص...
ActionDirectoryRefresh:h=اعادة انعاش الملفات
ActionDirectoryRefresh=&اعادة انعاش
ActionDirectoryRename:h=اعد تسمية الملف\المجلد
ActionDirectoryRename=اعد &التسمية
ActionDirectorySFTPDownload=تحميل
ActionDirectorySFTPUpload=رفع
ActionEdit=&تحرير
ActionEditCopy:h=انسخ المحدد وضعهة في ذاكرة النصوص
ActionEditCopy:s=Ctrl+C
ActionEditCopy=نسخ
ActionEditCopyWithLineNumbers:h=انسخ المحدد وضعهة في ذاكرة النصوص
ActionEditCopyWithLineNumbers:s=Ctrl+Alt+C
ActionEditCopyWithLineNumbers=نسخ بارقام السطر
ActionEditCut:h=قص المحدد وضعه في ذاكرة النصوص
ActionEditCut:s=Ctrl+X
ActionEditCut=&قص
ActionEditDecode:h=فك شفره
ActionEditDecode=فك شفره
ActionEditDecodeASCIIDecimal:h=العشرية ASCII فك شفرة
ActionEditDecodeASCIIDecimal=ASCII decimal
ActionEditDecodeBase1024:h=Decode base1024
ActionEditDecodeBase1024=1024
ActionEditDecodeBase128:h=Decode base128
ActionEditDecodeBase128=128
ActionEditDecodeBase256:h=Decode base256
ActionEditDecodeBase256=256
ActionEditDecodeBase32:h=Decode base32
ActionEditDecodeBase32=32
ActionEditDecodeBase4096:h=Decode base4096
ActionEditDecodeBase4096=4096
ActionEditDecodeBase64:h=Decode base64
ActionEditDecodeBase64=64
ActionEditDecodeBase85:h=Decode base85
ActionEditDecodeBase85=85
ActionEditDecodeBase91:h=Decode base91
ActionEditDecodeBase91=91
ActionEditDecodeBase:h=Decode base
ActionEditDecodeBase=Base
ActionEditDecodeBinary:h=Decode binary
ActionEditDecodeBinary=&ثنائي
ActionEditDecodeHex:h=Decode hex
ActionEditDecodeHex=Hex
ActionEditDecodeHexWithoutSpaces:h=Decode hex without spaces
ActionEditDecodeHexWithoutSpaces=Hex (without spaces)
ActionEditDecodeHTML:h=Decode HTML
ActionEditDecodeHTML=HTML
ActionEditDecodeOctal:h=فك الثماني
ActionEditDecodeOctal=&ثماني
ActionEditDecodeRotate13:h=تدوير من 13 مكانا
ActionEditDecodeRotate13=تدوير من 13 مكانا
ActionEditDecodeRotate18:h=تدوير من 18 مكانا
ActionEditDecodeRotate18=تدوير من 18 مكانا
ActionEditDecodeRotate47:h=تدوير من 47 مكانا
ActionEditDecodeRotate47=تدوير من 47 مكانا
ActionEditDecodeRotate5:h=تدوير بنسبة 5 اماكن
ActionEditDecodeRotate5=تدوير بنسبة 5 اماكن
ActionEditDecodeRotate:h=فك التدوير
ActionEditDecodeRotate=&استدارة
ActionEditDecodeURL:h=فك شفرة عنوان رابط
ActionEditDecodeURL=&رابط
ActionEditDelete=&حذف
ActionEditDeleteBeginningOfLine:h=حذف بداية السطر
ActionEditDeleteBeginningOfLine:s=Shift+Ctrl+T
ActionEditDeleteBeginningOfLine=بداية السطر
ActionEditDeleteCharForward:h=Delete char forward
ActionEditDeleteCharForward:s=Shift+BkSp
ActionEditDeleteCharForward=Char forward
ActionEditDeleteComments:h=حذف التعليقات
ActionEditDeleteComments=تعليقات
ActionEditDeleteDuplicateLines:h=حذف الاسطر المكررة
ActionEditDeleteDuplicateLines=&اسطر مكررة
ActionEditDeleteEndOfLine:h=حذف نهاية السطر
ActionEditDeleteEndOfLine:s=Shift+Ctrl+Y
ActionEditDeleteEndOfLine=&نهاية السطر
ActionEditDeleteLine:h=حذف السطر
ActionEditDeleteLine:s=Ctrl+Y
ActionEditDeleteLine=&السطر
ActionEditDeleteWhitespace:h=احذ النص المحدد
ActionEditDeleteWhitespace=&فراغ ابيض
ActionEditDeleteWord:h=حذف الكلمة
ActionEditDeleteWord:s=Ctrl+W
ActionEditDeleteWord=&الكلمة
ActionEditDeleteWordBackward:h=حذف الكلمة الخلفية
ActionEditDeleteWordBackward:s=Ctrl+BkSp
ActionEditDeleteWordBackward=خلفية الكلمة
ActionEditDeleteWordForward:h=الحذفة الكلمة الأمامة
ActionEditDeleteWordForward:s=Ctrl+Del
ActionEditDeleteWordForward=الكلمة الامامية
ActionEditEncode:h=ترميز
ActionEditEncode=ترميز
ActionEditEncodeASCIIDecimal:h=Encode ASCII decimal
ActionEditEncodeASCIIDecimal=ASCII decimal
ActionEditEncodeBase1024:h=Encode base1024
ActionEditEncodeBase1024=1024
ActionEditEncodeBase128:h=Encode base128
ActionEditEncodeBase128=128
ActionEditEncodeBase256:h=Encode base256
ActionEditEncodeBase256=256
ActionEditEncodeBase32:h=Encode base32
ActionEditEncodeBase32=32
ActionEditEncodeBase4096:h=Encode base4096
ActionEditEncodeBase4096=4096
ActionEditEncodeBase64:h=Encode base64
ActionEditEncodeBase64=64
ActionEditEncodeBase64WithLineBreaks:h=Encode base64 with line breaks
ActionEditEncodeBase64WithLineBreaks=64 (with line breaks)
ActionEditEncodeBase85:h=Encode base85
ActionEditEncodeBase85=85
ActionEditEncodeBase91:h=Encode base91
ActionEditEncodeBase91=91
ActionEditEncodeBase:h=Encode base
ActionEditEncodeBase=Base
ActionEditEncodeBinary:h=Encode binary
ActionEditEncodeBinary=&ثنائي
ActionEditEncodeHex:h=Encode hex
ActionEditEncodeHex=Hex
ActionEditEncodeHexWithoutSpaces:h=Encode hex without spaces
ActionEditEncodeHexWithoutSpaces=Hex (without spaces)
ActionEditEncodeHTML:h=Encode HTML
ActionEditEncodeHTML=HTML
ActionEditEncodeOctal:h=ترميز ثماني
ActionEditEncodeOctal=&ثماني
ActionEditEncodeRotate13:h=تدوير من 13 مكانا
ActionEditEncodeRotate13=تدوير من 13 مكانا
ActionEditEncodeRotate18:h=تدوير من 18 مكانا
ActionEditEncodeRotate18=تدوير من 18 مكانا
ActionEditEncodeRotate47:h=تدوير من 47 مكانا
ActionEditEncodeRotate47=تدوير من 47 مكانا
ActionEditEncodeRotate5:h=تدوير بنسبة 5 اماكن
ActionEditEncodeRotate5=تدوير بنسبة 5 اماكن
ActionEditEncodeRotate:h=تشفير تدوير
ActionEditEncodeRotate=&استدارة
ActionEditEncodeURL:h=ترميز رابط
ActionEditEncodeURL=&رابط
ActionEditFormatJSON=صيغة JSON
ActionEditFormatJSONIndent2:h=صيغة JSON
ActionEditFormatJSONIndent2:s=Ctrl+Shift+J
ActionEditFormatJSONIndent2=الطلب  2
ActionEditFormatJSONIndent3=الطلب  3
ActionEditFormatJSONIndent4=الطلب  4
ActionEditFormatJSONMinify=تصغير
ActionEditFormatSQL:h=صيغة SQL
ActionEditFormatSQL=صيغة SQL
ActionEditFormatXML=صيغة XML
ActionEditFormatXMLFormat:h=صيغة XML
ActionEditFormatXMLFormat:s=Ctrl+Shift+X
ActionEditFormatXMLFormat=صيغة
ActionEditFormatXMLMinify=تصغير
ActionEditIndentDecrease:h=انخفاض المسافة البادئة
ActionEditIndentDecrease:s=Shift+Ctrl+U
ActionEditIndentDecrease=&تخفيض
ActionEditIndentIncrease:h=زيادة المسافة البادئة
ActionEditIndentIncrease:s=Shift+Ctrl+I
ActionEditIndentIncrease=&زيادة
ActionEditInsert=ادخال
ActionEditInsertBlockComment:h=تبديل تعليق كتلة. الاختصار هو Ctrl+Shift+VK_OEM_2. The VK_OEM_2 يمكن ان يختلف المفتاح الافتراضي باختلاف لوحة المفاتيح. بالنسبة للوحة المفاتيح القياسية بالولايات المتحدة ، فهي '/?' مفتاح.
ActionEditInsertBlockComment=&حظر التعليق
ActionEditInsertDateTime:h=ادخال التاريخ والوقت
ActionEditInsertDateTime:s=Shift+Alt+D
ActionEditInsertDateTime=&التاريخ والوقت
ActionEditInsertGUID:h=ادخل GUID
ActionEditInsertGUID:s=Shift+Ctrl+G
ActionEditInsertGUID=GUID
ActionEditInsertHexColor:h=&الوان الهيكس
ActionEditInsertHexColor:s=Shift+Alt+C
ActionEditInsertHexColor=&الوان الهيكس
ActionEditInsertLine:h=ادخال سطر
ActionEditInsertLine:s=Ctrl+Enter
ActionEditInsertLine=&السطر
ActionEditInsertLineComment:h=تبديل تعليق الخط. الاختصار هو Ctrl+VK_OEM_2. The VK_OEM_2 يمكن ان يختلف المفتاح الافتراضي باختلاف لوحة المفاتيح. بالنسبة للوحة المفاتيح القياسية بالولايات المتحدة ، فهي '/?' مفتاح.
ActionEditInsertLineComment=&تعليق الخط
ActionEditInsertNull:h=إدراج حرف فارغ
ActionEditInsertNull:s=Shift+Ctrl+N
ActionEditInsertNull=Null
ActionEditInsertTag:h=ادخال HTML/XML اشارة
ActionEditInsertTag:s=Ctrl+T
ActionEditInsertTag=&HTML/XMLاشارة...
ActionEditModify=تعديل
ActionEditModifyJoin:h=الانضمام الى النص
ActionEditModifyJoin=&دمج
ActionEditModifyLineWrap:h=لف السطور مع العرض
ActionEditModifyLineWrap=&التفاف السطر
ActionEditModifySpacesToTabs:h=تحويل كل المسافات إلى علامات تبويب
ActionEditModifySpacesToTabs=مسافات إلى علامات التبويب
ActionEditModifySplit:h=تقسيم النص
ActionEditModifySplit=&تقسيم
ActionEditModifyTabsToSpaces:h=تحويل كل علامات التبويب إلى مسافات
ActionEditModifyTabsToSpaces=علامات التبويب للمسافات
ActionEditMove=نقل
ActionEditMoveLineDown:h=نقل السطر للاسفل
ActionEditMoveLineDown:s=Shift+Ctrl+Down
ActionEditMoveLineDown=&سطر للاسفل
ActionEditMoveLineUp:h=نقل السطر للاعلى
ActionEditMoveLineUp:s=Shift+Ctrl+Up
ActionEditMoveLineUp=&سطر للاعلى
ActionEditMoveNextWord:h=انتقل إلى الكلمة التالية
ActionEditMoveNextWord:s=Ctrl+Right
ActionEditMoveNextWord=الكلمة التالية
ActionEditMovePreviousWord:h=الانتقال إلى الكلمة السابقة
ActionEditMovePreviousWord:s=Ctrl+Left
ActionEditMovePreviousWord=الكلمة السابقة
ActionEditMoveSelectionDown:h=نقل التحديد للاسفل
ActionEditMoveSelectionDown:s=Shift+Alt+Down
ActionEditMoveSelectionDown=&تحديد اسفل
ActionEditMoveSelectionLeft:h=نقل التحديد اليسار
ActionEditMoveSelectionLeft:s=Shift+Alt+Left
ActionEditMoveSelectionLeft=&تحديد اليسار
ActionEditMoveSelectionRight:h=نقل التحديد لليمين
ActionEditMoveSelectionRight:s=Shift+Alt+Right
ActionEditMoveSelectionRight=&تحديد اليمين
ActionEditMoveSelectionUp:h=نقل التحديد لاعلى
ActionEditMoveSelectionUp:s=Shift+Alt+Up
ActionEditMoveSelectionUp=&تحديد اعلى
ActionEditPaste:h=ادخال محتويات ذاكرة النصوص
ActionEditPaste:s=Ctrl+V
ActionEditPaste=&لصق
ActionEditRedo:h=اعد العمل السابق
ActionEditRedo:s=Shift+Ctrl+Z
ActionEditRedo=&استعادة
ActionEditSelectAll:h=تحديد الكل
ActionEditSelectAll:s=Ctrl+A
ActionEditSelectAll=&تحديد الكل
ActionEditSort=&الفرز
ActionEditSortAsc:h=فرز تصاعدي
ActionEditSortAsc:s=Shift+Ctrl+A
ActionEditSortAsc=&تصاعدي
ActionEditSortDesc:h=فرز تنازلي
ActionEditSortDesc:s=Shift+Ctrl+D
ActionEditSortDesc=&تنازلي
ActionEditSortRandom:h=فرز عشوائي
ActionEditSortRandom=&عشوائية
ActionEditToggleCase:h=تثبيت الكشف
ActionEditToggleCase:s=Shift+Ctrl+C
ActionEditToggleCase=&تبديل الحالة
ActionEditToggleCaseAlternating:h=تثبيت كشف التناوب
ActionEditToggleCaseAlternating=التناوب
ActionEditToggleCaseLower:h=تثبيت كشف الواطئ
ActionEditToggleCaseLower:s=Ctrl+L
ActionEditToggleCaseLower=واطئ
ActionEditToggleCaseSentence:h=تثبيت كشف الجملة
ActionEditToggleCaseSentence=الجملة
ActionEditToggleCaseTitle:h=تثبيت كشف العنوان
ActionEditToggleCaseTitle=العنوان
ActionEditToggleCaseUpper:h=تثبيت كشف العالي
ActionEditToggleCaseUpper:s=Ctrl+U
ActionEditToggleCaseUpper=عالي
ActionEditTrim=تشذيب
ActionEditTrimBoth:h=تشذيب اليسار واليمين
ActionEditTrimBoth=&كلاهما
ActionEditTrimLeft:h=تشذيب اليسار
ActionEditTrimLeft=&اليسار
ActionEditTrimRight:h=تشذيب اليمين
ActionEditTrimRight=&اليمين
ActionEditUndo:h=الغاء الحدث الاخير
ActionEditUndo:s=Ctrl+Z
ActionEditUndo=&تراجع
ActionEditValidateXML=Validate XML
ActionFile=&ملف
ActionFileAddToFavourites:h=إضافة ملف إلى المفضلة
ActionFileAddToFavourites:s=Ctrl+D
ActionFileAddToFavourites=إضافة للمفضلة
ActionFileCanClose:h=تبديل ما اذا كان يمكن اغلاق التبويب ام لا
ActionFileCanClose=يمكن ان تغلق
ActionFileClose=&اغلاق
ActionFileCloseActive:h=اغلاق المستند النشط
ActionFileCloseActive:s=Ctrl+F4
ActionFileCloseActive=&نشط
ActionFileCloseAll:h=اغلاق كل الملفات
ActionFileCloseAll=&الكل
ActionFileCloseAllOther:h=اغلق كل الصفحات الاخرى
ActionFileCloseAllOther:s=Shift+Ctrl+F4
ActionFileCloseAllOther=&كل الاخرى
ActionFileCloseModified:h=اغلق الملفات المعدلة
ActionFileCloseModified=&المعدلة
ActionFileCloseSelected:h=اغلاق الملفات المحددة
ActionFileCloseSelected=&المحدد
ActionFileCloseUnmodified:h=اغلق الملفات غير المعدلة
ActionFileCloseUnmodified=&غير المعدلة
ActionFileContextMenu:h=قائمة المحتويات
ActionFileContextMenu=&قائمة المحتويات
ActionFileExit:h=اخرج من البرنامج
ActionFileExit:s2=هروب
ActionFileExit:s=Alt+F4
ActionFileExit=&خروج
ActionFileFavourites=المفضلة
ActionFileFavouritesProperties=الخصائص...
ActionFileHTMLExport:h=HTML تصدير
ActionFileHTMLExport=تصدير HTML
ActionFileInfo:h=معلومات حول الملف النشط
ActionFileInfo=معلومة
ActionFileMoveCaretAtTheEndAfterReload:h=تبديل المحرر حرك علامة الإقحام في النهاية بعد إعادة التحميل
ActionFileMoveCaretAtTheEndAfterReload=حرك علامة الاقحام في النهاية بعد اعادة التحميل
ActionFileNew:h=انشئ مستند جديد
ActionFileNew:s=Ctrl+N
ActionFileNew=&جديد
ActionFileOpen:h=افتح مستند موجود
ActionFileOpen:s=Ctrl+O
ActionFileOpen=&افتح...
ActionFileOpenCommandPrompt:h=فتح موجه الاوامر
ActionFileOpenCommandPrompt=موجه الامر
ActionFileOpenFileExplorer:h=فتح ملف المستكشف
ActionFileOpenFileExplorer=مستكشف الملفات
ActionFileOpenInBrowser:h=اظهر المستند الحالي في المتصفح الافتراضي
ActionFileOpenInBrowser:s=Alt+B
ActionFileOpenInBrowser=&اظهر في المتصفح
ActionFilePrint:h=اطبع مستند نشط
ActionFilePrint:s=Ctrl+P
ActionFilePrint=&طباعة...
ActionFilePrintPreview:h=عرض المستند النشط
ActionFilePrintPreview=&عرض الطابعة...
ActionFileProperties:h=شاهد خصائص الملف
ActionFileProperties=&الخصائص...
ActionFileReadOnly:h=محرر التبديل للقراءة فقط
ActionFileReadOnly=للقراءة فقط
ActionFileReloadAutomatically:h=تبديل اعادة تحميل المحرر تلقائيا
ActionFileReloadAutomatically=اعادة التحميل تلقائيا
ActionFileRemoveFromFavourites=إزالة من المفضلة
ActionFileRenameTab:t=Translation needed
ActionFileRenameTab=Rename tab
ActionFileReopenProperties=&الخصائص ...
ActionFileSave:h=حفظ المستند النشط
ActionFileSave:s=Ctrl+S
ActionFileSave=&حفظ
ActionFileSaveAll:h=حفظ كل المستندات
ActionFileSaveAll:s=Shift+Ctrl+S
ActionFileSaveAll=حفظ الكل
ActionFileSaveAs:h=حفظ المستند النشط باسم جديد
ActionFileSaveAs:s=Ctrl+Alt+S
ActionFileSaveAs=حفظ باسم...
ActionFileSelectFromDirectory:h=اختر من المجلد النشط
ActionFileSelectFromDirectory=اختر من المجلد
ActionFileTrimTrailingSpaces:h=تبديل المحرر لقص المسافات الزائدة
ActionFileTrimTrailingSpaces=تشذيب المساحات الزائدة
ActionFileUpload=رفع
ActionGotoNextBookmark:h=انتقل الى الاشارة المرجعية التالية
ActionGotoNextBookmark:s=F2
ActionGotoNextBookmark=&التالي
ActionGotoPreviousBookmark:h=انتقل الى الاشارة المرجعية السابقة
ActionGotoPreviousBookmark:s=Shift+F2
ActionGotoPreviousBookmark=&السابق
ActionHelp=&التعليمات
ActionHelpAboutTextEditorPro:h=عرض معلومات عن البرنامج
ActionHelpAboutTextEditorPro=&Text Editor Pro حول
ActionHelpCheckForUpdates:h=التحقق من التحديثات
ActionHelpCheckForUpdates=&التدقيق على التحديثات
ActionHelpSendFeedback:h=ارسال ملاحظات الى info@texteditor.pro
ActionHelpSendFeedback=ارسال ملاحظات الى
ActionHelpShortcuts:h=اظهار اختصارات لوحه المفاتيح
ActionHelpShortcuts:s=Ctrl+F1
ActionHelpShortcuts=اختصارات
ActionHelpVisitHomepage:h=زيارة Text Editor Pro الصفحة الرسمية - https://texteditor.pro
ActionHelpVisitHomepage=&زيارة الموقع الرسمي
ActionImageViewRotateClockwise:h=تدوير الصفحة في اتجاه عقارب الساعة
ActionImageViewRotateCounterClockwise:h=تدوير الصفحة عكس اتجاه عقارب الساعة
ActionImageViewZoomIn:h=تكبير
ActionImageViewZoomOut:h=تصغير
ActionMenuEdit:h=تغيير لتحرير صفحه القائمة
ActionMenuFile:h=تغيير الى صفحه قائمه الملفات
ActionMenuHelp:h=التغيير الى تعليمات صفحة القائمة
ActionMenuSearch:h=التغيير الى صفحة قائمة البحث
ActionMenuTools:h=التغيير الى صفحة قائمة الادوات
ActionMenuView:h=التغيير لعرض صفحة القائمة
ActionOpenColorTheme:h=فتح قائمة موضوع لون شريط العنوان
ActionOpenColorTheme:s=Alt+F11
ActionOpenColorTheme=لون الثيم
ActionOpenEncoding:h=فتح قائمة ترميز شريط العنوان
ActionOpenEncoding:s=Alt+F9
ActionOpenEncoding=ترميز
ActionOpenFileList:h=فتح قائمة ملف شريط العنوان
ActionOpenFileList:s=Alt+F12
ActionOpenFileList=ملفات
ActionOpenHighlighter:h=افتح قائمة تمييز شريط العناوين
ActionOpenHighlighter:s=Alt+F10
ActionOpenHighlighter=مميز
ActionOutputClose=&اغلاق
ActionOutputCloseActive:h=اغلق الصفحة الحالية
ActionOutputCloseActive=نشط
ActionOutputCloseAll:h=اغلق كل الصفحات
ActionOutputCloseAll=اغلاق الكل
ActionOutputCloseAllOtherPages:h=اغلق الكل
ActionOutputCloseAllOtherPages=اغلق كل الصفحات الاخرى
ActionOutputCloseSelected:h=اغلاق المحدد
ActionOutputCloseSelected=&المحدد
ActionOutputCollapseAll:h=&طي الكل
ActionOutputCollapseAll=طي الكل
ActionOutputCopyAllToClipboard:h=انسخ الكل لذاكرة النصوص
ActionOutputCopyAllToClipboard=انسخ الكل لذاكرة النصوص
ActionOutputCopySelectedToClipboard:h=استنساخ المحدد لذاكرة النصوص
ActionOutputCopySelectedToClipboard=انسخ المحدد لذاكرة النصوص
ActionOutputExpandAll:h=توسيع الكل
ActionOutputExpandAll=توسيع الكل
ActionOutputOpenAll:h=فتح كل الملفات
ActionOutputOpenAll=&فتح الكل
ActionOutputOpenSelected:h=فتح الملفات المحددة
ActionOutputOpenSelected=&فتح المحدد
ActionOutputRefresh=انعاش
ActionOutputSelectAll:h=حدد كل الملفات
ActionOutputSelectAll=تحديد الكل
ActionOutputUnselectAll:h=الغاء تحديد كل الملفات
ActionOutputUnselectAll=الغاء تحديد الكل
ActionPDFFindNext:h=اوجد التالي
ActionPDFFindPrevious:h=اوجد السابق
ActionPDFNextPage:h=Next page
ActionPDFPreviousPage:h=الصفحة السابقة
ActionPDFRotatePageClockwise:h=تدوير الصفحة في اتجاه عقارب الساعة
ActionPDFRotatePageCounterClockwise:h=تدوير الصفحة عكس اتجاه عقارب الساعة
ActionPDFSearchHighlightAll:t=Translation needed
ActionPDFSearchHighlightAll=Highlight all
ActionPDFSearchMatchCase=حساسية الموضوع
ActionPDFSearchWholeWords=الكلمات الكاملة فقط
ActionPDFZoomIn:h=تكبير
ActionPDFZoomOut:h=تصغير
ActionSearch=&البحث
ActionSearchBookmarks:h=Show or refresh all saved bookmarks
ActionSearchBookmarks:t=Translation needed
ActionSearchBookmarks=قوائم العناوين
ActionSearchClearBookmarks:h=مسح كل قائمة العناوين
ActionSearchClearBookmarks=مسح العلامات
ActionSearchClose:h=&اغلاق
ActionSearchClose=حساسية الموضوع
ActionSearchEngine:h=حدد محرك البحث
ActionSearchEngine=حدد محرك البحث
ActionSearchFindAll:h=البحث عن كل النصوص المطابقة
ActionSearchFindAll:s=Alt+Enter
ActionSearchFindAll=بحث الكل
ActionSearchFindDuplicates:h=البحث عن التكرارات
ActionSearchFindDuplicates=البحث عن التكرارات
ActionSearchFindInFiles:h=ابحث عن سلاسل في الملفات المتعددة
ActionSearchFindInFiles:s=Shift+Ctrl+F
ActionSearchFindInFiles=&اوجد في الملفات...
ActionSearchFindNext:h=اوجد النص المتطابق مع النص
ActionSearchFindNext:s=F3
ActionSearchFindNext=&اوجد التالي
ActionSearchFindPrevious:h=جد السابق المتطابق مع النص
ActionSearchFindPrevious:s=Shift+F3
ActionSearchFindPrevious=&اوجد السابق
ActionSearchGoToBookmarks:h=اذهب الى قائمة العناوين
ActionSearchGoToBookmarks=اذهب الى العلامات
ActionSearchGoToLine:h=اذهب الى السطر
ActionSearchGoToLine:s=Ctrl+G
ActionSearchGoToLine=اذهب للتخطيط
ActionSearchInSelection:h=في الاختيار
ActionSearchInSelection=في الاختيار
ActionSearchMatchCase:h=حساسية الموضوع
ActionSearchMatchCase=حساسية الموضوع
ActionSearchOptions:h=خيارات البحث
ActionSearchOptions=خيارات البحث
ActionSearchReplace:h=استبدل النص الموجود بنص اخر
ActionSearchReplace:s=Ctrl+R
ActionSearchReplace=&استبدل...
ActionSearchSearchButton:h=ابحث عن النص المطلوب
ActionSearchSearchButton:s=Ctrl+F
ActionSearchSearchButton=&بحث...
ActionSearchSpellCheck:h=التدقيق الاملائي
ActionSearchSpellCheck:s=F6
ActionSearchSpellCheck=التدقيق الاملائي
ActionSearchSpellCheckNextError:h=خطا التدقيق الاملائي التالي
ActionSearchSpellCheckNextError:s=Ctrl+F6
ActionSearchSpellCheckNextError=الخطا التالي
ActionSearchSpellCheckPreviousError:h=خطا التدقيق الاملائي السابق
ActionSearchSpellCheckPreviousError:s=Ctrl+Shift+F6
ActionSearchSpellCheckPreviousError=الخطا السابق
ActionSearchTextItems:h=العناصر التي تم البحث عنها
ActionSearchTextItems=العناصر التي تم البحث عنها...
ActionSearchToggleBookmark:h=اعداد او مسح العلامة في السطر الحالي. العلامات يمكن اعداداها ايضا ب by using Ctrl+Shift+1..9. اذهب الى العلامات Ctrl+1..9.
ActionSearchToggleBookmark:s=Ctrl+F2
ActionSearchToggleBookmark=&تبديل الاشارة المرجعية
ActionSearchToggleBookmarks:h=تثبيت قائمة العناوين
ActionSearchToggleBookmarks=&تبديل الاشارات المرجعية
ActionSearchWholeWords:h=الكلمات الكاملة فقط
ActionSearchWholeWords=الكلمات الكاملة فقط
ActionStatusBarShowCaretPosition=اظهر مراقبة الموقع
ActionStatusBarShowCharacterCount=إظهار عدد الأحرف
ActionStatusBarShowEditorZoom=إظهار تكبير/تصغير لـ المحرر
ActionStatusBarShowEncoding=اظهار الترميز
ActionStatusBarShowFileLineBreak:t=Translation needed
ActionStatusBarShowFileLineBreak=Show file line break
ActionStatusBarShowFileOpeningTime=إظهار وقت فتح الملف
ActionStatusBarShowHints=تلميحات المعرض
ActionStatusBarShowKeyState=اظهر حالة المفتاح
ActionStatusBarShowLineCount:t=Translation needed
ActionStatusBarShowLineCount=Show line count
ActionStatusBarShowMacro=عرض المختصر
ActionStatusBarShowModified=اظهر التعديل
ActionStatusBarShowSelectionInfo=اظهار معلومات التحديد
ActionStatusBarShowSizeGrip=اظهار قبضة الحجم
ActionToolbarMenuLanguage=&اللغة
ActionToolbarMenuLayout=&النسق
ActionToolbarMenuLayoutSingle=&عمود
ActionToolbarMenuLayoutThreeColumns=&ثلاثة اعمدة
ActionToolbarMenuLayoutTwoColumns=&عمودين
ActionToolbarMenuView=&العرض
ActionTools=&الادوات
ActionToolsCharacterMap:h=ادخال رموز تشفير للمستند النشط بواسطة النقر المزدوج
ActionToolsCharacterMap=&لوحة الرموز المشفرة...
ActionToolsClipboardHistory:h=سجل الحافظة
ActionToolsClipboardHistory=سجل الحافظة
ActionToolsConvert:h=تحويل بين الوحدات الرقمية
ActionToolsConvert=المحول...
ActionToolsExecute:h=تنفيذ التطبيقات المخصصة
ActionToolsExecute=تنفيذ
ActionToolsExecuteConfigure:h=تكوين خصائص التنفيذ
ActionToolsExecuteConfigure=&تهيئة...
ActionToolsLanguageEditor:h=محرر اللغة
ActionToolsLanguageEditor=&محرر اللغة...
ActionToolsMacro=المختصر
ActionToolsMacroOpen:h=افتح مع اختصار جديد
ActionToolsMacroOpen=&افتح مجلد...
ActionToolsMacroPause:h=توقيف مؤقت للمختصر
ActionToolsMacroPause:s=Shift+Ctrl+R
ActionToolsMacroPause=&توقف
ActionToolsMacroPlayback:h=اعادة المختصر
ActionToolsMacroPlayback:s=Shift+Ctrl+P
ActionToolsMacroPlayback=&اعادة
ActionToolsMacroRecord:h=تسجيل المختصر
ActionToolsMacroRecord:s=Shift+Ctrl+R
ActionToolsMacroRecord=&تسجيل
ActionToolsMacroSaveAs:h=احفظ المختصر مع اسم جديد
ActionToolsMacroSaveAs=&احفظ باسم...
ActionToolsMacroStop:h=ايقاف تسجيل المختصر
ActionToolsMacroStop:s=Shift+Ctrl+S
ActionToolsMacroStop=&ايقاف
ActionToolsMagnifier:h=&المكبر
ActionToolsMagnifier=&المكبر
ActionToolsMagnifierBorderStyle:h=&نمط الحدود
ActionToolsMagnifierBorderStyle=&نمط الحدود
ActionToolsMagnifierBorderStyleDefault:h=نمط الحدود الافتراضي
ActionToolsMagnifierBorderStyleDefault=&افتراضي
ActionToolsMagnifierBorderStyleFlat:h=نمط الحدود شقة
ActionToolsMagnifierBorderStyleFlat=&مسطحة
ActionToolsMagnifierBorderStyleNone:h=ليس لها حدود
ActionToolsMagnifierBorderStyleNone=&لاشئ
ActionToolsMagnifierClose:h=اغلاق المكبر
ActionToolsMagnifierClose:s=خروج
ActionToolsMagnifierClose=&اغلاق
ActionToolsMagnifierScaling16x:h=التدرج ستة عشر مرة
ActionToolsMagnifierScaling16x=16x
ActionToolsMagnifierScaling2x:h=التدرج المزدوجة
ActionToolsMagnifierScaling2x=2x
ActionToolsMagnifierScaling4x:h=التدرج الرباعي
ActionToolsMagnifierScaling4x=4x
ActionToolsMagnifierScaling8x:h=التدرج ثماني مرات
ActionToolsMagnifierScaling8x=8x
ActionToolsMagnifierScaling:h=&تدريج
ActionToolsMagnifierScaling=&تدريج
ActionToolsMagnifierStyle:h=&نمط
ActionToolsMagnifierStyle=&نمط
ActionToolsMagnifierStyleLens:h=نمط العدسة
ActionToolsMagnifierStyleLens=&عدسة
ActionToolsMagnifierStyleRectangle:h=مستطيل الاسلوب
ActionToolsMagnifierStyleRectangle=&مستطيل
ActionToolsOptions:h=اعدادات الخيارات
ActionToolsOptions=&الاختيارات...
ActionToolsPauseSpeaking:h=&توقف عن الكلام
ActionToolsPauseSpeaking=&توقف عن الكلام
ActionToolsSelectForTextCompare:h=اختر مستند للمقارنة
ActionToolsSelectForTextCompare=اختر للموازنة...
ActionToolsSpeech=&الكلام
ActionToolsStartSpeaking:h=&ابدا بالتحدث
ActionToolsStartSpeaking=&ابدا بالتحدث
ActionToolsStopSpeaking:h=&توقف عن الكلام
ActionToolsStopSpeaking=&توقف عن الكلام
ActionToolsTextCompare:h=قارن الملفات
ActionToolsTextCompare=&موازنة الملفات..
ActionView=&العرض
ActionViewBookmarkList:h=Show or hide the bookmark list
ActionViewBookmarkList:t=Translation needed
ActionViewBookmarkList=Bookmark list
ActionViewColorThemeSelection:h=اظهار او اخفاء محدد اللون
ActionViewColorThemeSelection=&اللون
ActionViewDirectory=الدليل
ActionViewDirectoryClose:h=اغلق المجلد النشط
ActionViewDirectoryClose:s=Shift+Alt+X
ActionViewDirectoryClose=&اغلق المجلد
ActionViewDirectoryEdit:h=تعديل المجلد النشط
ActionViewDirectoryEdit:s=Shift+Ctrl+E
ActionViewDirectoryEdit=&تعديل المجلد...
ActionViewDirectoryOpen:h=افتح مجلد جديد
ActionViewDirectoryOpen:s=Ctrl+Alt+D
ActionViewDirectoryOpen=&افتح مجلد...
ActionViewDirectoryVisibility:h=اخفاء او اظهرا المجلد
ActionViewDirectoryVisibility=&المجلد
ActionViewEncodingSelection:h=اظهار او اخفاء محدد التشفير
ActionViewEncodingSelection=&التشفير
ActionViewFiles:h=ابحث عن ملفات في المجلد وتفرعاته
ActionViewFiles:s=Ctrl+F12
ActionViewFiles=&الملفات...
ActionViewFolding=للطي
ActionViewFoldingCollapse=الطي
ActionViewFoldingCollapseAll:h=&انهيار كل
ActionViewFoldingCollapseAll=&طي الكل
ActionViewFoldingCollapseAllDownFromActiveLine:h=&طي الكل اسفل من السطر النشط
ActionViewFoldingCollapseAllDownFromActiveLine=&طي الكل اسفل من السطر النشط
ActionViewFoldingCollapseAllUpFromActiveLine:h=&تصغير الكل من السطر النشط
ActionViewFoldingCollapseAllUpFromActiveLine=&تصغير الكل من السطر النشط
ActionViewFoldingCollapseLine:h=&تصغير السطر
ActionViewFoldingCollapseLine:s=Ctrl+Alt+Left
ActionViewFoldingCollapseLine=&تصغير السطر
ActionViewFoldingExpand=موسع
ActionViewFoldingExpandAll:h=&توسيع الكل
ActionViewFoldingExpandAll=&توسيع الكل
ActionViewFoldingExpandAllDownFromActiveLine:h=&توسيع الكل اسفل من السطر النشط
ActionViewFoldingExpandAllDownFromActiveLine=&توسيع الكل اسفل من السطر النشط
ActionViewFoldingExpandAllUpFromActiveLine:h=&توسيع الكل ما يصل من سطر النشط
ActionViewFoldingExpandAllUpFromActiveLine=&توسيع الكل ما يصل من سطر النشط
ActionViewFoldingExpandLine:h=&توسيع السطر
ActionViewFoldingExpandLine:s=Ctrl+Alt+Right
ActionViewFoldingExpandLine=&توسيع السطر
ActionViewFoldingNext:h=الانتقال الى الطي التالي
ActionViewFoldingNext:s=Ctrl+Alt+Down
ActionViewFoldingNext=&التالي
ActionViewFoldingPrevious:h=الانتقال الى الطي السابق
ActionViewFoldingPrevious:s=Ctrl+Alt+Up
ActionViewFoldingPrevious=&السابق
ActionViewFullScreen:h=تبديل الشاشة الكاملة
ActionViewFullScreen:s=F11
ActionViewFullScreen=شاشة كاملة
ActionViewHexEditor:h=اظهار او اخفاء المحرر هيكس hex editor
ActionViewHexEditor:s=Ctrl+H
ActionViewHexEditor=محرر الهيكس
ActionViewHighlighterSelection:h=اخفاء او اظهار  الشفافية المحددة
ActionViewHighlighterSelection=&الشفافية
ActionViewLineNumbers:h=تبديل ارقام السطر
ActionViewLineNumbers=ارقام السطر
ActionViewMainMenu:h=اخفاء او اظهار القائمة
ActionViewMainMenu=&القائمة الرئيسية
ActionViewMenuBar:h=اخفاء او اظهار شريط القائمة
ActionViewMenuBar=&شريط القائمة
ActionViewMiniMap:h=اخفاء او اظهار الخريطة المصغرة
ActionViewMiniMap=خريطة مضغرة
ActionViewNextPage:h=اذهب الى الصفحة التالية
ActionViewNextPage:s=Ctrl+Tab
ActionViewNextPage=&الصفحة التالية
ActionViewOutput:h=اخفاء او اظهار المخرج
ActionViewOutput=&المخرج
ActionViewPreviousPage:h=اذهب الى الصفحة السابقة
ActionViewPreviousPage:s=Shift+Ctrl+Tab
ActionViewPreviousPage=&الصفحة السابقة
ActionViewRuler:h=اظهار او اخفاء المسطرة
ActionViewRuler=مسطرة
ActionViewSelectionMode:h=تثبيت وضع التحديد. وايضا اضغط على Alt والمحرر سوف يثبت وضع التحديد.
ActionViewSelectionMode=وضع التحديد
ActionViewSFTP=SFTP
ActionViewSFTPConnect=الاتصال
ActionViewSFTPDisconnect=قطع الاتصال
ActionViewSFTPEdit=تحرير
ActionViewSkinSelector=&محدد الجلد
ActionViewSpecialChars:h=تثبيت رموز خاصة
ActionViewSpecialChars=&رموز خاصة
ActionViewSplit:h=شذب المستند
ActionViewSplit=&شذب
ActionViewSplitHorizontal:h=انقسام افقي
ActionViewSplitHorizontal=&افقي
ActionViewSplitVertical:h=انقسام عمودي
ActionViewSplitVertical=&عمودي
ActionViewStatusBar:h=اظهار او اخفاء شريط الحالة
ActionViewStatusBar=&شريط الحالة
ActionViewSyncEdit:h=اظهار او اخفاء مزامنة العديل
ActionViewSyncEdit:s=Shift+Ctrl+H
ActionViewSyncEdit=مزامنة التعديل
ActionViewTitleBar=&شريط العنوان
ActionViewTitleBarApplicationName:h=إظهار أو إخفاء اسم تطبيق شريط العنوان
ActionViewTitleBarApplicationName=اسم التطبيق
ActionViewTitleBarFavourite:h=إظهار أو إخفاء شريط العنوان المفضل
ActionViewTitleBarFavourite=المفضل
ActionViewTitleBarFileList:h=اظهار او اخفاء ملف القائمة من شريط العنان
ActionViewTitleBarFileList=&ملف القائمة
ActionViewTitleBarFilename:h=اظههار او اخفاء اسم الملف من شريط العنوان
ActionViewTitleBarFilename=&اسم الملف
ActionViewTitleBarMagnifier=المكبر
ActionViewToolbar:h=اظهار او اخفاء شريط الادوات
ActionViewToolbar=&شريط الادوات
ActionViewWordWrap:h=تبديل حالة التواء الكلمة
ActionViewWordWrap=&التواء الكلمة
ActionViewXMLTree:h=اظهار او اخفاء XML تفرعات
ActionViewXMLTree=&XML تفرع
ActionViewZoomEditorIn:h=تكبير المحرر
ActionViewZoomEditorIn=تكبير
ActionViewZoomEditorOut:h=تصغير المحرر
ActionViewZoomEditorOut=تصغير
ActionViewZoomEditorReset:h=إعادة تعيين التكبير/التصغير في المحرر
ActionViewZoomEditorReset=إعادة تعيين التكبير/التصغير
ActionXMLTreeRefresh:h=انعاش XML تفرع
ActionXMLTreeRefresh=&انعاش

[Message]
CannotFindString=لايمكن ايجاد السلسلة "%s"
DuplicatesWereNotFound=لم يتم العثور على التكرارات
InstallNewVersion=تثبيت إصدار البرنامج الجديد?
LatestVersion=انت تستخدم اخر اصدار.
NoDefaultPrinter=لاتوجد طابعة محددة يرجى التحديد.
PdfErrorPassword=كلمة السر مطلوبة أو غير صالحة.
ScaleChange=قد لا يتم عرض بعض تغييرات القياس بشكل صحيح حتى تقوم باعادة تشغيل التطبيق.
SelectFilePathFromDirectory=حدد مسار الملف من المجلد

[OptionsApplicationFrame]
CheckBoxAddApplicationInOpentWithContextMenu='اضافة تطبيق في قائمة السياق 'فتح باستخدام
CheckBoxAllowExitWithEsc=esc السماح للخروج مع
CheckBoxAllowMultipleInstances=السماح بمثيلات متعددة
CheckBoxCloseMinimizes=اغلاق التقليل
CheckBoxDropFiles=ملقات الاسقاط
CheckBoxHotExit:h=إغلاق دون المطالبة بحفظ الملفات، سيتم الاحتفاظ بالملفات واستعادتها.
CheckBoxHotExit=مخرج ساخن
CheckBoxMinimizeToSystemTray=تصغير الى علبه النظام
CheckBoxStayOnTop=ابق على القمة
CheckBoxUseLatestCommonDialogs:t=Translation needed
CheckBoxUseLatestCommonDialogs=Use the latest common dialogs
CheckBoxUseReverseUTF8Naming:t=Translation needed
CheckBoxUseReverseUTF8Naming=Use reverse UTF-8 encoding naming
ComboBoxLanguage=اللغة
SpinEditReopenMaxFileCount:t=Translation needed
SpinEditReopenMaxFileCount=Reopen max file count
SpinEditSplitterSize=حجم المقسم

[OptionsApplicationScalingFrame]
RadioButtonAuto=تلقائي
RadioButtonPercent=نسبه مئويه
RadioButtonPixelsPerInch=بكسل لكل بوصة

[OptionsApplicationUpdatesFrame]
CheckBoxCheckForUpdatesAtStartup=التحقق من وجود تحديثات عند بدء التشغيل
CheckBoxCheckForUpdatesWhenClosing=التحقق من وجود تحديثات عند الاغلاق

[OptionsApplicationClipboardHistoryFrame]
CheckBoxClipboardHistoryEnabled=مفعل
SpinEditClipboardHistoryItemsCount=عدد العناصر

[OptionsApplicationModifiedFilesFrame]
CheckBoxAskToReloadModifiedFiles=اطلب اعادة التحميل
CheckBoxMoveCaretAtTheEnd=حرك علامة الاقحام في النهاية بعد اعادة التحميل
CheckBoxPollFileChanges:t=Translation needed
CheckBoxPollFileChanges=Poll file changes
CheckBoxReloadAutomaticallyModifiedFiles=اعادة التحميل تلقائيا
SpinEditPollingInterval:t=Translation needed
SpinEditPollingInterval=Polling interval (ms)

[OptionsDirectoryFrame]
CheckBoxAutoHide=اخفاء تلقائي
CheckBoxAutoSelect:t=Translation needed
CheckBoxAutoSelect=Auto select
CheckBoxUseSelectedPathAsDefaultDirectory=المسار المحدد كدليل افتراضي
CheckBoxShowArchiveFiles=اظهر الملفات المضغوطة
CheckBoxShowHiddenFiles=اظهر الملفات المخفية
CheckBoxShowOverlayIcons=عرض ايقونات الغطاء
CheckBoxShowSystemFiles=اظهر ملفات النظام
CheckBoxShowTreeLines=اظهر تفرعات الاسطر
CheckBoxUseExplorerTheme=استخدام موضوع المستكشف
ComboBoxAlign=الصف
SpinEditIndent=القطع
SpinEditMargin=حافة

[OptionsDirectoryTabsFrame]
CheckBoxBoldActiveTab=علامة تبويب نشطة غامقة
CheckBoxCloseTabByDblClick=اغلاق التبويب بالضغط المزدوج
CheckBoxCloseTabByMiddleClick=اغلاق التبويب بضغط الوسط
CheckBoxEnlargeActiveTab=تكبير التبويب النشطة
CheckBoxMultiline=سطر متعدد
CheckBoxRightClickSelect=اختر الزر الايمن
CheckBoxSaveTabs=حفظ التبويب
CheckBoxShowIcon=اظهر الصورة
CheckBoxShowOpenDirectoryButton=اظهر زر فتح المجلد
ComboBoxShowCloseButton=اظهر زر الاغلاق
GroupBoxFont=الخط
GroupBoxFontSize=حجم الخط
RadioButtonFontCustom=مخصص
RadioButtonFontDefault=افتراضي
RadioButtonFontSizeCustom=مخصص
RadioButtonFontSizeDefault=افتراضي
SpinEditTabHeight=الارتفاع
SpinEditTabMargin=حافة
SpinEditTabSpacing=تباعد

[OptionsEditorBackupFrame]
CheckBoxActive=مفعل
EditFileExtension=امتداد الملف
GroupBoxPath=مسار
GroupBoxSuffix=لاحقة
RadioButtonPathCustom=مخصص
RadioButtonPathFile=ملف
RadioButtonSuffixCounter=عداد
RadioButtonSuffixDateAndTime=التاريخ و الوقت
RadioButtonSuffixNone=لا شيئ

[OptionsEditorBookmarkListFrame]
CheckBoxShowFilters:t=Translation needed
CheckBoxShowFilters=Show filters
CheckBoxShowLineNumbers:t=Translation needed
CheckBoxShowLineNumbers=Show line numbers
CheckBoxTrimText:t=Translation needed
CheckBoxTrimText=Trim text
CheckBoxUpdateForAllBookmarkLists:t=Translation needed
CheckBoxUpdateForAllBookmarkLists=Update for all bookmark lists
CheckBoxUpdateWidthWhenResized:t=Translation needed
CheckBoxUpdateWidthWhenResized=Update width when resized
CheckBoxVisible:t=Translation needed
CheckBoxVisible=Visible
ComboBoxAlign:t=Translation needed
ComboBoxAlign=Align
GroupBoxSortBy:t=Translation needed
GroupBoxSortBy=Sort by
RadioButtonSortByColor:t=Translation needed
RadioButtonSortByColor=Color
RadioButtonSortByLineNumber:t=Translation needed
RadioButtonSortByLineNumber=Line number
RadioButtonSortByText:t=Translation needed
RadioButtonSortByText=Text
SpinEditWidth=العرض

[OptionsEditorCaretFrame]
CheckBoxMultipleCaretsActive=مفعل
CheckBoxMultipleCaretsShowActiveLine=اظهار الخط النشط
CheckBoxMultipleCaretsShowGhost=عرض الشبح
CheckBoxNonblinkingCaretActive=مفعل
CheckBoxRightMouseClickMovesCaret=ضغط الزر الايمن لتحريك علامة الادخال
CheckBoxVisible=مرئي
ColorComboBoxNonblinkingCaretBackground=لون الخلفية
ColorComboBoxNonblinkingCaretForeground=لون المقدمة
ComboBoxStylesInsertCaret=ادخال
ComboBoxStylesOverwriteCaret=كتابة
GroupBoxMultipleCarets=الاقنعة المتعددة
GroupBoxNonBlinkingCaret=علامة ادخال بدون ترميش
GroupBoxStyles=الاسلوب

[OptionsEditorColorFrame]
ActionReset=اعادة تعيين
CheckBoxElementsAttributesBold=عريض
CheckBoxElementsAttributesItalic=مائل
CheckBoxElementsAttributesUnderline=اسفل الخط
CheckBoxSkinActiveLineBackground=خلفية السطر النشطة
CheckBoxSkinBackground=خلفية
CheckBoxSkinBookmarkPanelBackground=خلفية لوحة قائمة العناوين
CheckBoxSkinCodeFoldingBackground=رمز خلفية قابلة للطي
CheckBoxSkinCodeFoldingHintBackground=رمز الطي تلميح الخلفية
CheckBoxSkinCompletionProposalBackground=انهاء الخلفية المقترحة
CheckBoxSkinCompletionProposalSelectionBackground=اكمال اختيار اقتراح الخلفية
CheckBoxSkinForeground=المقدمة
CheckBoxSkinLeftMarginBackground=خلفية الحافة اليسرى
CheckBoxSkinSelectionBackground=الخلفية المحددة
CheckBoxSkinSelectionForeground=المقدمة المحددة
ColorComboBoxEditorColor=&اللون
ColorComboBoxElementsBackground=خلفية
ColorComboBoxElementsForeground=المقدمة
ComboBoxColorTheme=الالوان
ComboBoxEditorElement=المواد
ComboBoxElementsName=الاسم
ComboBoxHighlighter=ضوء عالي
DateEditDate=التاريخ
EditEmail=البريد الالكتروني
EditName=الاسم
EditVersion=الاصدار
GroupBoxAttributes=الخواص
LabelSkinDescription=استخدم لون الغلاف للمواد المحددة
TabSheetAuthor=المؤلف
TabSheetEditor=المحرر
TabSheetElements=المواد
TabSheetGeneral=العام
TabSheetUseSkinColor=استخدم لون الغلاف

[OptionsEditorCompletionProposalFrame]
CheckBoxActive=مفعل
CheckBoxAddHighlighterKeywords=اضف كلمات اساسية للتمييز
CheckBoxAutoInvoke=استناد تلقائي
CheckBoxMatchCase=حالة الاحرف
CheckBoxParseWordsFromText=تحليل الكلمات من النص
CheckBoxShowSnippets=إظهار المقتطفات
ComboBoxKeywordCase=حالة الكلمات الرئيسية
ComboBoxShortcut=الاختصار
SpinEditNumberOfRows=عدد الصفوف

[OptionsEditorCompletionProposalSnippetsFrame]
ActionAdd:h=إضافة قصاصة
ActionAdd=إضافة 
ActionClone:h=Clone snippet
ActionClone:t=Translation needed
ActionClone=Clone
ActionDelete:h=حذف قصاصة مختارة
ActionDelete=حذف
ActionEdit:h=تحرير قصاصة
ActionEdit=تحرير 
VirtualDrawTree:0=قصاصة
VirtualDrawTree:1=وصف

[SnippetEditDialog]
CheckBoxCursorPositionActive=نشط
CheckBoxSelectionActive=نشط
ComboBoxExecuteWith=تنفيذ مع
ComboBoxGroupName=اسم المجموعة
ComboBoxHighlighter=قلم تمييز
ComboBoxShortcut=اختصار
EditDescription=وصف
EditKeyword=الكلمة الرئيسية
GroupBoxCursorPosition=موضع المؤشر
GroupBoxSelection=اختيار
SpinEditCursorPositionColumn=عمود
SpinEditCursorPositionRow=صف
SpinEditSelectionFromColumn=من العمود
SpinEditSelectionFromRow=من الصف
SpinEditSelectionToColumn=إلى العمود
SpinEditSelectionToRow=إلى صف
TextEditor=مقتطف

[OptionsEditorDefaultsFrame]
ComboBoxDefaultColor=&اللون
ComboBoxDefaultEncoding=&التشفير
ComboBoxDefaultHighlighter=الشفافية
ComboBoxDefaultSQLHighlighter=SQL شفافية
EditBrowser=التصفح
GroupBoxDirectory=الدليل
RadioButtonCurrentWindowsDirectory=دليل وندوز الحالي
RadioButtonCustomDirectory=دليل مخصص
RadioButtonLatestDirectory=أحدث دليل

[OptionsEditorFoldingFrame]
CheckBoxExpandByHintClick=تمديدها من قبل تلميح نقرة
CheckBoxFoldMultilineComments=طوي ملاحظات السطور المتعددة
CheckBoxHighlightIndentGuides=ابرز خطوط ارشاد البادئة
CheckBoxHighlightMatchingPair=ابرز زوج متطابق
CheckBoxShowCollapsedCodeHint=اظهار تلميح رمز التشعب
CheckBoxShowCollapsedLine=اظهار تشعب السطر
CheckBoxShowCollapseMarkAtTheEnd=اظهار علامة الانهيار في النهاية
CheckBoxShowIndentGuides=اظهار خطوط ارشاد البادئة
CheckBoxShowTreeLine=اظهار خط الشجرة
CheckBoxTextFoldingActive=تمكين
CheckBoxVisible=مرئي
ComboBoxGuideLineStyle=نمط خط التوجيه
ComboBoxMarkStyle=اسلوب العلامة
GroupBoxCodeFolding=طي الكود
GroupBoxTextFolding=ملف نصي للطي
RadioButtonOutlinedByACharacter=الخطوط العريضة من قبل شخصية
RadioButtonOutlinedBySpacesAndTabs=الخطوط العريضة للمسافات وعلامات التبويب
SpinEditCollapsedRowCharacterCount=تم تصغير عدد الصفوف
SpinEditDelayInterval=(فاصل التاخر (بالميلي ثانية
SpinEditHintRowCount=تلميح احصاء الاسطر

[OptionsEditorFontFrame]
ActionReset=استعادة
CheckBoxUseSameSettingsForAllColorThemes:t=Translation needed
CheckBoxUseSameSettingsForAllColorThemes=Use same settings for all color themes
ComboBoxColorTheme=&اللون
ComboBoxElement=المادة
FontComboBoxFont=الخط
SpinEditFontSize=حجم الخط

[OptionsEditorLeftMarginFrame]
CheckBoxAutoSize=حجم تلقائي
CheckBoxLineStateShowOnlyModified:t=Translation needed
CheckBoxLineStateShowOnlyModified=Show only modified
CheckBoxLineStateVisible=مرئي
CheckBoxVisible=مرئي
ComboBoxLineStateAlign=المحاذاة
GroupBoxLineState:t=Translation needed
GroupBoxLineState=Line state
SpinEditWidth=العرض

[OptionsEditorLeftMarginBookmarksFrame]
CheckBoxSaveBookmarks:t=Translation needed
CheckBoxSaveBookmarks=Save bookmarks
CheckBoxShowBookmarkColorsPopup:t=Translation needed
CheckBoxShowBookmarkColorsPopup=Show bookmark colors popup
CheckBoxShowPanel=اظهر لوحة قائمة العناوين
CheckBoxVisible=مرئي
ColorComboBoxLineColor=لون خط اقائمة العناوين
SpinEditPanelWidth=عرض لوحة قائمة العناوين

[OptionsEditorLeftMarginLineNumbersFrame]
CheckBoxShowAfterLastLine=اظهر بعد السطر الاخير
CheckBoxShowInTens=اظهر بالعشرات
CheckBoxShowLeadingZeros=اظهر الاصفار الرئيسية
CheckBoxVisible=مرئي
SpinEditStartFrom=ابدء من

[OptionsEditorMatchingPairFrame]
CheckBoxAutoComplete=اكمال تلقائي
CheckBoxHighlightActive=مفعل
CheckBoxHighlightAfterToken=ابرز ما بعد المنطلق
CheckBoxHighlightUnmatched=ابرز ما لا نظير لها
GroupBoxDisplay=عرض
GroupBoxHighlight=تمييزر
RadioButtonHighlight=تمييز
RadioButtonUnderline=تسطير

[OptionsEditorMinimapFrame]
CheckBoxBlendingEnabled=ممكن
CheckBoxBlendingInvert=عكس
CheckBoxShowBookmarks=اظهار الاشارات المرجعية
CheckBoxShowBorder=اظهار الحدود
CheckBoxShowIndentGuides=اظهار خطوط ارشاد البادئة
CheckBoxShowSearchResults=عرض نتائج البحث
CheckBoxShowSelection=عرض التحديد
CheckBoxShowShadow=اظهار الظل
CheckBoxVisible=مرئي
ComboBoxAlign=المحاذاة
GroupBoxBlending=مزج
SpinEditWidth=عرض

[OptionsEditorOptionsFrame]
CheckBoxAutoChangeEncoding:t=Translation needed
CheckBoxAutoChangeEncoding=Auto change encoding when saved
CheckBoxAutoIndent=التلقائي
CheckBoxAutoSave=حفظ تلقائي
CheckBoxDragDropEditing=الاسقاط بالسحب ليتم تعديلها
CheckBoxGroupUndo=التراجع عن المجموعة
CheckBoxSaveUnmodified=حفظ غير معدل
CheckBoxShowControlCharacters=إظهار أحرف التحكم
CheckBoxShowNonBreakingSpaceAsSpace=إظهار المساحة غير الفاصلة كمساحة
CheckBoxShowNullCharacters=إظهار أحرف فارغة
CheckBoxShowWarningBeforeSaving:t=Translation needed
CheckBoxShowWarningBeforeSaving=Show warning before saving
CheckBoxShowZeroWidthSpaceCharacters=إظهار أحرف مساحة العرض الصفري
CheckBoxTrailingLineBreak=فاصل اسطر بعد السطر الاخير
CheckBoxTrimTrailingSpaces=تقليم المسافات الزائدة
CheckBoxUndoAfterSave=التراجع بعد حفظ
ComboBoxDefaultLineBreak=فاصل الاسطر الافتراضي
GroupBoxInternationalCharacters:t=Translation needed
GroupBoxInternationalCharacters=International characters with ASCII/ANSI encoding 
SpinEditBorderWidth=عرض الحد
SpinEditLineSpacing=تباعد الاسطر
SpinEditMargin=الحافة

[OptionsEditorRightMarginFrame]
CheckBoxAutoLineBreak=الي فصل السطر
CheckBoxMouseMove=حركة الفارة
CheckBoxShowMovingHint=اظهر تلميح الحركة
CheckBoxVisible=مرئي
SpinEditPosition=الموقع

[OptionsEditorRulerFrame]
CheckBoxShowSelection=عرض التحديد
CheckBoxVisible=مرئي
SpinEditHeight=مرتفع

[OptionsEditorScrollFrame]
CheckBoxAutosizeMaxWidth=عرض الحجم تلقائي الاقصى
CheckBoxHalfPage=نصف الصفحة
CheckBoxHintFollows=تلميح التتبع
CheckBoxPastEndOfFile=لصق في نهايةالملف
CheckBoxPastEndOfLineMarker=النهاية السابقة من علامة السطر
CheckBoxShowHint=اظهار التلميح
CheckBoxShowHorizontalScrollBar=اظهار شريط التمرير الافقي
CheckBoxShowShadow=اظهار الظل
CheckBoxShowVerticalScrollBar=اظهار شريط التمرير العمودي

[OptionsEditorSearchFrame]
CheckBoxAutoCompleteEnabled=مفعل
CheckBoxBeepIfSearchStringNotFound=ملائمة اذا لم تكن سلاسل البحث موجودة
CheckBoxClearWhenClosed=مسح عند الاغلاق
CheckBoxEntireScope=كامل المجال
CheckBoxFileSpecificSearch=ملف-بحث معين
CheckBoxFindWordAtCursor=البحث عن كلمة في المؤشر
CheckBoxHighlightResult=نتائج الابراز
CheckBoxMatchCase=حالة المطابقة
CheckBoxNearOperatorEnabled=مفعل
CheckBoxSearchOnTyping=بحث بواسطة النوع
CheckBoxSearchOnTypingEnabled=مفعل
CheckBoxSetFocusIntoEditorWithEnter=تعيين التركيز إلى المحرر مع إدخال
CheckBoxShowSearchMap=اظهار خريطة البحث
CheckBoxShowSearchMatchNotFound=اظهار تطابق البحث غير موجود
CheckBoxShowSearchStringNotFound=اظهار سلسلة البحث غير موجود
CheckBoxToggleSearchBar=تبديل شريط البحث
CheckBoxUseUpAndDownArrowKeysToFind:t=Translation needed
CheckBoxUseUpAndDownArrowKeysToFind=Use up and down arrow keys to find
CheckBoxVisible=مرئي
CheckBoxWholeWords=الكلمات الكاملة فقط
CheckBoxWrapAround=التواء حول
ComboBoxSearchBarAlign=محاذاة شريط البحث
ComboBoxSearchMapAlign=المحاذاة
GroupBoxAutoComplete=اكمال تلقائي
GroupBoxNearOperator:h=Syntax: Word1 NEAR Word2 or Word1 NEAR:d Word2, where d is the maximum distance of words.
GroupBoxNearOperator:t=Translation needed
GroupBoxNearOperator=NEAR operator
GroupBoxSearchOnTyping=البحث على الكتابة
SpinEditAutoCompleteDelayInterval=(الفاصل الزمني للتاخير (م ث
SpinEditNearOperatorMaximumDistance:t=Translation needed
SpinEditNearOperatorMaximumDistance=Maximum distance
SpinEditNearOperatorMinimumDistance:t=Translation needed
SpinEditNearOperatorMinimumDistance=Minimum distance
SpinEditSearchOnTypingDelayInterval=(الفاصل الزمني للتاخير (م ث

[OptionsEditorSelectionFrame]
CheckBoxALTSetsColumnMode=ALT تعيين وضع العمود
CheckBoxAutoCopyToClipboard=نسخ تلقائي الى الحافظة
CheckBoxExpandPrefixCharacters=توسيع أحرف البادئة
CheckBoxExpandRealNumbers=توسيع الاعداد الحقيقية
CheckBoxFromEndOfLine=من نهاية السطر
CheckBoxHighlightSimilarTerms=ابراز المصطلحات المشابهة
CheckBoxTermsMatchCase=شروط حالة الاحرف
CheckBoxToEndOfLastLine=من نهاية السطر الاخير
CheckBoxToEndOfLine=الى نهاية السطر
CheckBoxTripleClickRowSelect=النقر الثلاثي فوق صف للاختيار
CheckBoxVisible=مرئي

[OptionsEditorSortFrame]
CheckBoxCaseSensitive:t=Translation needed
CheckBoxCaseSensitive=Case sensitive
CheckBoxNaturalSortOrder:t=Translation needed
CheckBoxNaturalSortOrder=Natural sort order

[OptionsEditorSpecialCharsFrame]
CheckBoxLineBreakVisible=مرئي
CheckBoxSelectionVisible=مرئي
CheckBoxVisible=مرئي
ColorComboBoxLineBreakColor=&اللون
ColorComboBoxSelectionColor=&اللون
ComboBoxArrowStyle=الاسلوب
ComboBoxLineBreakStyle=الاسلوب
GroupBoxColor=لون
GroupBoxLineBreak=&اللون
GroupBoxSelection=الاختيار
RadioButtonCustomColor=استخدام اللون
RadioButtonMiddleColor=استخدام الالوان المتوسطة
RadioButtonTextColor=استخدام لون النص

[OptionsEditorSpellCheckFrame]
CheckBoxActive=ممكن
ColorComboBoxUnderlineColor=لون
ComboBoxDictionary=القاموس
ComboBoxUnderlineType=النوع
GroupBoxUnderline=تسطير

[OptionsEditorSyncEditFrame]
CheckBoxActive=مفعل
CheckBoxMatchCase=حالة الاحرف
CheckBoxShowActivateIcon=اظهار ايقونة التنشيط

[OptionsEditorTabsFrame]
CheckBoxBoldActiveTab=علامة تبويب نشطة غامقة
CheckBoxCloseTabByDblClick=اغلق التبويب عن طريق النقر المزدوج
CheckBoxCloseTabByMiddleClick=اغلق التبويب عن طريق النقر بالزر الاوسط
CheckBoxDimReadOnlyWhenNotActive=قراءة خافتة فقط عندما لا تكون نشطة
CheckBoxEnlargeActiveTab=تكبير التبويب النشطة
CheckBoxHideCloseButtonWhenCanCloseIsNotChecked=اخفاء زر الاغلاق عند الاغلاق الغير محدد
CheckBoxMultiline=متعدد
CheckBoxRightClickSelect=انقر بزر الماوس الايمن
CheckBoxSaveTabs=حفظ علامات التبويب
CheckBoxShowFileNameAsHint=إظهار اسم الملف كتلميح
CheckBoxShowIcon=اظهر الصورة
CheckBoxShowNewFileButton=عرض زر ملف جديد
ComboBoxShowCloseButton=اظهار زر الاغلاق
GroupBoxFont=الخط
GroupBoxFontSize=حجم الخط
RadioButtonFontCustom=مخصص
RadioButtonFontDefault=افتراضي
RadioButtonFontSizeCustom=مخصص
RadioButtonFontSizeDefault=افتراضي
SpinEditTabHeight=الارتفاع
SpinEditTabMargin=هامش
SpinEditTabSpacing=تباعد

[OptionsEditorTabulatorFrame]
CheckBoxColumns=الاعمدة
CheckBoxPreviousLineIndent=سطر البادئة السابقة
CheckBoxSelectedBlockIndent=اختيارالبادئة المحضورة
CheckBoxTabsToSpaces=اضغط للمسافة
SpinEditWidth=عرض

[OptionsEditorWordWrapFrame]
CheckBoxActive=مرئي
ComboBoxWidth=عرض

[OptionsEditorXMLTreeFrame]
CheckBoxUseExplorerTheme=استخدام شكل المستكشف
CheckBoxVisible=مرئي
ComboBoxAlign=المحاذاة
SpinEditWidth=عرض

[OptionsFileTypesFrame]
EditExtensions=الاختصارات
VirtualDrawTree:0=نوع الملف

[OptionsForm]
ActionApplication=تطبيق
ActionApplicationClipboardHistory=تاريخ الحافظة
ActionApplicationModifiedFiles=الملفات المعدلة
ActionApplicationScaling=القياس
ActionApplicationUpdates=لتحديثات
ActionCompare=مقارنة ملفات
ActionDirectory=المجلد
ActionDirectoryTabs=منظم الجداول
ActionEditor=محرر
ActionEditorBackup=نسخ احتياطي
ActionEditorBookmarkList:t=Translation needed
ActionEditorBookmarkList=Bookmark list
ActionEditorCaret=علامة الاقحام
ActionEditorColors=الالوان
ActionEditorCompletionProposal=اكمال مشروع
ActionEditorCompletionProposalSnippets=قصاصات
ActionEditorDefaults=الافتراضي
ActionEditorFolding=رمز الطي
ActionEditorFonts=الخط
ActionEditorLeftMargin=الحد الايسر
ActionEditorLeftMarginBookmarks=قوائم العناوين
ActionEditorLeftMarginLineNumbers=رقم السطر
ActionEditorMatchingPair=الزوج المطابق
ActionEditorMinimap=خريطة مصغرة
ActionEditorRightMargin=الحد الايمن
ActionEditorRuler=مسطرة
ActionEditorScroll=تدوير
ActionEditorSearch=البحث
ActionEditorSelection=التحديد
ActionEditorSort:t=Translation needed
ActionEditorSort=Sort
ActionEditorSpecialChars=رموز خاصة
ActionEditorSpellCheck=التدقيق الاملائي
ActionEditorSyncEdit=تعديل المزامنة
ActionEditorTabs=التبويبات
ActionEditorTabulator=منظم الجداول
ActionEditorWordWrap=التواء الكلمة
ActionEditorXMLTree=XML tree
ActionFileTypes=انواع الملف
ActionHexEditor=محرر الهيكس
ActionHTMLExport=تصدير HTML
ActionImageView:t=Translation needed
ActionImageView=Image view
ActionJSONFormatter=JSON صيغ
ActionMainMenu=القائمة الرئيسية
ActionMarkdownPreview:t=Translation needed
ActionMarkdownPreview=Markdown preview
ActionMarkdownPreviewOptions=الخيارات
ActionMenuBar=شريط القوائم
ActionMenuBarButtons=خيارات الزر
ActionMenuBarTabs=خيارات الجدولة
ActionOpen:h=اكتب الخيارات في ملف INI
ActionOpen=فتح...
ActionOutput=الاخراج
ActionOutputTabs=التبويبات
ActionPDFView=PDF view
ActionPrint=طباعة
ActionSaveAs:h=قراءة الخيارات من ملف INI
ActionSaveAs=حفظ باسم...
ActionSkin=جلد
ActionSkinButtons=ازرار
ActionSkinEffects=تاثيرات
ActionSkinFont=خط
ActionSkinHints=تلميحات
ActionSkinScrollBars=أشرطة التمرير
ActionSkinStyles=اساليب
ActionSQLFormatter=SQL صيغ
ActionSQLFormatterCapitalization=القيمة
ActionSQLFormatterFormatting:t=Translation needed
ActionSQLFormatterFormatting=Formatting
ActionSQLFormatterIndentation=القطع
ActionStatusBar=شريط الحالة
ActionTitleBar=شريط العنوان
ActionToolbar=شريط الادوات
ActionToolbarOptions=الخيارات
ActionXMLFormatter=XML صيغ
Caption=الخيارات

[OptionsHexEditorFrame]
CheckBoxAutosize=تحجيم تلقائي
CheckBoxHexLowerCase=احرف صغيرة سداسية
CheckBoxInsertMode:t=Translation needed
CheckBoxInsertMode=Insert mode
CheckBoxShowRuler=عرض المسطرة
ComboBoxCaretStyle=اسلوب الاقحام

[OptionsHTMLExportFrame]
CheckBoxAddToClipboard:t=Translation needed
CheckBoxAddToClipboard=Add to clipboard
CheckBoxShowLineNumbers:t=Translation needed
CheckBoxShowLineNumbers=Show line numbers

[OptionsMainMenuFrame]
GroupBoxFont=الخط
GroupBoxFontSize=حجم الخط
RadioButtonFontCustom=مخصص
RadioButtonFontDefault=افتراضي
RadioButtonFontSizeCustom=مخصص
RadioButtonFontSizeDefault=افتراضي

[OptionsMarkdownPreviewFrame]
CheckBoxVisible=مرئي
CheckBoxAutoSize=حجم تلقائي
CheckBoxUseColorTheme:t=Translation needed
CheckBoxUseColorTheme=Use color theme
SpinEditWidth=العرض
ComboBoxAlign=الصف

[OptionsMarkdownPreviewOptionsFrame]
CheckBoxBackslashEspacesHTMLTags:t=Translation needed
CheckBoxBackslashEspacesHTMLTags=Backslash escapes HTML tags
CheckBoxDisableForcedSpaces:t=Translation needed
CheckBoxDisableForcedSpaces=Disable the requirement of indenting sublists by 4 spaces for them to be nested
CheckBoxUnderline:t=Translation needed
CheckBoxUnderline=Disable underscore parsing as <em> or <strong>
CheckBoxSimplifiedAutoLink:t=Translation needed
CheckBoxSimplifiedAutoLink=Enable automatic linking in plain text URLs
CheckBoxEncodeEmails:t=Translation needed
CheckBoxEncodeEmails=Enable e-mail address automatic obfuscation
CheckBoxEmojis:t=Translation needed
CheckBoxEmojis=Enable emoji support
CheckBoxEllipsis:t=Translation needed
CheckBoxEllipsis=Enable horizontal ellipsis conversion
CheckBoxTasklists:t=Translation needed
CheckBoxTasklists=Enable support for GFM takslists
CheckBoxMentions:t=Translation needed
CheckBoxMentions=Enable support for github @mentions
CheckBoxCodeBlocks:t=Translation needed
CheckBoxCodeBlocks=Enable support for GFM code block style syntax (fenced codeblocks)
CheckBoxParseImgDimensions:t=Translation needed
CheckBoxParseImgDimensions=Enable support for setting image dimensions from within markdown syntax
CheckBoxStrikethrough:t=Translation needed
CheckBoxStrikethrough=Enable support for strikethrough syntax
CheckBoxTables:t=Translation needed
CheckBoxTables=Enable support for tables syntax
CheckBoxExcludeTrailingPunctuationFromURLs:t=Translation needed
CheckBoxExcludeTrailingPunctuationFromURLs=Exclude trailing punctuation from autolinked URLs
CheckBoxLiteralMiddleWordAsterisks:t=Translation needed
CheckBoxLiteralMiddleWordAsterisks=Literal middle word asterisks
CheckBoxOmitExtraWLInCodeBlocks:t=Translation needed
CheckBoxOmitExtraWLInCodeBlocks=Omit the trailing newline in a code block
CheckBoxSimpleLineBreaks:t=Translation needed
CheckBoxSimpleLineBreaks=Parse line breaks as <br/> in paragraphs (like GitHub does)
CheckBoxRequireSpaceBeforeHeadingText:t=Translation needed
CheckBoxRequireSpaceBeforeHeadingText= Require a space between # and header text
CheckBoxSplitAdjacentBlockquotes:t=Translation needed
CheckBoxSplitAdjacentBlockquotes=Split adjacent blockquotes
CheckBoxLiteralMiddleWordUnderscores:t=Translation needed
CheckBoxLiteralMiddleWordUnderscores=Treat underscores in middle of words as literal characters
SpinEditHeaderStartingLevel:t=Translation needed
SpinEditHeaderStartingLevel=Header starting level

[OptionsMenuBarFrame]
ActionAddDivider:h=اضافة مقسم
ActionAddDivider=اضف مقسما
ActionAddButton:h=اضف مادة
ActionAddButton=اضف مادة
ActionDelete:h=حذف
ActionDelete=حذف
ActionMoveDown:h=حرك المادة المحدد للاسفل
ActionMoveDown=تحريك للاسفل
ActionMoveUp:h=حرك المادة المحدد للاعلى
ActionMoveUp=تحريك للاعلى
ActionReset:h=استعادة مواد القائمة
ActionReset=استعادة
VirtualDrawTree:0=مواد القائمة
VirtualDrawTree:h=استخدم السحب والاسقاط لتحريك مواد القائمة. اضغط الزر الايمن لادخال وحذف المواد.

[OptionsMenuBarTabsFrame]
CheckBoxBoldActiveTab=علامة تبويب نشطة غامقة
CheckBoxEnlargeActiveTab=تكبير التبويب النشطة
CheckBoxShowMenu=قائمة العرض
GroupBoxTabsFont=الخط
GroupBoxTabsFontSize=حجم الخط
RadioButtonTabsFontCustom=مخصص
RadioButtonTabsFontDefault=افتراضي
RadioButtonTabsFontSizeCustom=مخصص
RadioButtonTabsFontSizeDefault=افتراضي
SpinEditTabHeight=الارتفاع
SpinEditTabMargin=هامش
SpinEditTabPadding=حشوة
SpinEditTabSpacing=تباعد

[OptionsMenuBarButtonsFrame]
CheckBoxBlended=ممزوج
CheckBoxGrayed=رمادي
CheckBoxReflected=انعكست
GroupBoxButtonsFont=الخط
GroupBoxButtonsFontSize=حجم الخط
GroupBoxDisabled=معطل
GroupBoxIcons=الرموز
RadioButtonButtonsFontCustom=مخصص
RadioButtonButtonsFontDefault=افتراضي
RadioButtonButtonsFontSizeCustom=مخصص
RadioButtonButtonsFontSizeDefault=افتراضي
RadioButtonLargeIcons=كبير
RadioButtonSmallIcons=صغير
TrackEditBlend=المزيج

[OptionsOutputFrame]
CheckBoxShowCheckBox=اظهر صندوق التحقق
CheckBoxShowOnlyLineNumbers:t=Translation needed
CheckBoxShowOnlyLineNumbers=Show only line numbers
CheckBoxShowTreeLines=اظهر تفرع السطر
CheckBoxUseExplorerTheme=استخدام شكل المستكشف
ComboBoxAlign=الصف
SpinEditIndent=قطع
SpinEditMargin=حافة

[OptionsOutputTabsFrame]
CheckBoxBoldActiveTab=علامة تبويب نشطة غامقة
CheckBoxCloseTabByDblClick=اغلق التبويب عن طريق النقر المزدوج
CheckBoxCloseTabByMiddleClick=اغلق التبويب عن طريق النقر بالزر الاوسط
CheckBoxEnlargeActiveTab=تكبير التبويب النشطة
CheckBoxMultiline=سطرمتعدد
CheckBoxRightClickSelect=انقر بزر الماوس الايمن
CheckBoxSaveTabs=حفظ علامات التبويب
CheckBoxShowFindInFilesButton=اظهار البحث في زر الملفات
CheckBoxShowIcon=اظهر الصورة
ComboBoxShowCloseButton=اظهر زر الاغلاق
GroupBoxFont=الخط
GroupBoxFontSize=حجم الخط
RadioButtonFontCustom=مخصص
RadioButtonFontDefault=افتراضي
RadioButtonFontSizeCustom=مخصص
RadioButtonFontSizeDefault=افتراضي
SpinEditTabHeight=الارتفاع
SpinEditTabMargin=Margin
SpinEditTabSpacing=تباعد

[OptionsImageViewFrame]
CheckBoxControlBarVisible=مرئي
CheckBoxEnabled=مفعل
ComboBoxControlBarAlign=الصف
ComboBoxZoom=تكبير/تصغير
GroupBoxControlBar=شريط التحكم

[OptionsPDFViewFrame]
CheckBoxControlBarVisible=مرئي
CheckBoxEnabled=مفعل
CheckBoxSearchBarHighlightAll:t=Translation needed
CheckBoxSearchBarHighlightAll=Highlight all
CheckBoxSearchBarMatchCase=حالة الاحرف
CheckBoxSearchBarToggleSearchBar=تبديل شريط البحث
CheckBoxSearchBarVisible=مرئي
CheckBoxSearchBarWholeWords=الكلمة الكاملة فقط
ComboBoxControlBarAlign=الصف
ComboBoxSearchBarAlign=الصف
ComboBoxZoom=تكبير/تصغير
GroupBoxControlBar=شريط التحكم
GroupBoxSearchBar:t=Translation needed
GroupBoxSearchBar=Search bar

[OptionsPrintFrame]
CheckBoxColorsEnabled=مفعل
CheckBoxLineNumbersInMargin=على الهامش
CheckBoxLineNumbersVisible=مرئي
CheckBoxShowFooterLine=اظهر السطر الذيلي
CheckBoxShowHeaderLine=اظهر السطر الراسي
CheckBoxShowOnlyPageNumber=اظهار رقم الصفحة فقط
CheckBoxUseRomanNumerals=استخدم الارقام الرومانية
CheckBoxVisibleDateTime=مرئي
CheckBoxVisibleFilename=مرئي
CheckBoxVisiblePageNumber=مرئي
CheckBoxVisiblePrintedBy=مرئي
CheckBoxWordWrap=التواء الكلمة
ComboBoxColorTheme=لون الثيم
GroupBoxAlignmentDateTime=المحاذاة
GroupBoxAlignmentFilename=المحاذاة
GroupBoxAlignmentPageNumber=المحاذاة
GroupBoxAlignmentPrintedBy=المحاذاة
GroupBoxColors=الالوان
GroupBoxDateTime=وقت البيانات
GroupBoxFilename=اسم المستند
GroupBoxFont=الخط
GroupBoxFontSize=حجم الخط
GroupBoxLineNumbers=ارقام الاسطر
GroupBoxMargins=هوامش
GroupBoxPageNumber=رقم  الصفحة
GroupBoxPrintedBy=تم الطبع بواسطة
GroupBoxVerticalAlignmentDateTime=محاذاة عمودية
GroupBoxVerticalAlignmentFilename=محاذاة عمودية
GroupBoxVerticalAlignmentPageNumber=محاذاة عمودية
GroupBoxVerticalAlignmentPrintedBy=محاذاة عمودية
RadioButtonAlignmentLeftDateTime=يسار
RadioButtonAlignmentLeftFilename=يسار
RadioButtonAlignmentLeftPageNumber=يسار
RadioButtonAlignmentLeftPrintedBy=يسار
RadioButtonAlignmentRightDateTime=يمين
RadioButtonAlignmentRightFilename=يمين
RadioButtonAlignmentRightPageNumber=يمين
RadioButtonAlignmentRightPrintedBy=يمين
RadioButtonFontCustom=مخصص
RadioButtonFontEditor=محرر
RadioButtonFontSizeCustom=مخصص
RadioButtonFontSizeEditor=محرر
RadioButtonVerticalAlignmentFooterDateTime=هامش
RadioButtonVerticalAlignmentFooterFilename=هامش
RadioButtonVerticalAlignmentFooterPageNumber=هامش
RadioButtonVerticalAlignmentFooterPrintedBy=هامش
RadioButtonVerticalAlignmentHeaderDateTime=عنوان راسي
RadioButtonVerticalAlignmentHeaderFilename=عنوان راسي
RadioButtonVerticalAlignmentHeaderPageNumber=عنوان راسي
RadioButtonVerticalAlignmentHeaderPrintedBy=عنوان راسي
SpinEditMarginsBottom=القاع
SpinEditMarginsLeft=يسار
SpinEditMarginsRight=يمين
SpinEditMarginsTop=اعلى
TabSheetHeadedAndFooter=عنوان راسي و الهامش
TabSheetOptions=الخيارات

[OptionsSQLFormatterCapitalizationFrame]
ComboBoxKeywords=كلمات دليلية
ComboBoxNames=الاسماء
ComboBoxParameters=المعلمات

[OptionsSQLFormatterFrame]
CheckBoxAlwaysVisible:t=Translation needed
CheckBoxAlwaysVisible=Always visible
CheckBoxSelectDefaultSQLHighlighter:t=Translation needed
CheckBoxSelectDefaultSQLHighlighter=Select default SQL highlighter

[OptionsJSONFormatterFrame]
CheckBoxAlwaysVisible:t=Translation needed
CheckBoxAlwaysVisible=Always visible
CheckBoxSelectJSONHighlighter:t=Translation needed
CheckBoxSelectJSONHighlighter=Select JSON highlighter

[OptionsXMLFormatterFrame]
CheckBoxAlwaysVisible:t=Translation needed
CheckBoxAlwaysVisible=Always visible
CheckBoxSelectXMLHighlighter:t=Translation needed
CheckBoxSelectXMLHighlighter=Select XML highlighter

[OptionsSQLFormatterFormattingFrame]
CheckBoxAlignKeywordsRightInStatements=محاذاة الكلمات الرئيسية في البيانات
CheckBoxBreakJoinOnSections=كسر أقسام الانضمام
CheckBoxExpandBetweenConditions=توسع بين الشروط
CheckBoxExpandBooleanExpressions=توسيع التعبيرات المنطقية
CheckBoxExpandCaseStatements=توسيع عبارات الحالة
CheckBoxExpandCommaLists=توسيع قوائم الفواصل
CheckBoxExpandGroupByClause=توسيع المجموعة حسب الجملة
CheckBoxExpandInLists=توسيع قوائم IN
CheckBoxExpandInsertStatements=توسيع عبارات إدراج
CheckBoxExpandJoinOnBooleanExpressions=توسيع التعبيرات المنطقية
CheckBoxExpandOrderByClause=توسيع عبارة الترتيب حسب
CheckBoxSpaceAfterComma=مسافة بعد الفاصلة
CheckBoxTrailingCommas=الفواصل اللاحقة

[OptionsSQLFormatterIndentationFrame]
CheckBoxRightPadColumnNames=أسماء أعمدة اللوحة اليمنى في إنشاء جدول أو عرض
CheckBoxUseTab=استخدم مفتاح تنظيم الجدول
SpinEditIndentLength=طول القطع

[OptionsStatusBarFrame]
CheckBoxAutoSizePanels:t=Translation needed
CheckBoxAutoSizePanels=Auto size panels
CheckBoxShowCaretPosition=اظهر مراقبة الموقع
CheckBoxShowCharacterCount=إظهار عدد الأحرف
CheckBoxShowEditorZoom=إظهار تكبير/تصغير لـ المحرر
CheckBoxShowEncoding=اظهار الترميز
CheckBoxShowFileLineBreak:t=Translation needed
CheckBoxShowFileLineBreak=Show file line break
CheckBoxShowFileOpeningTime=إظهار وقت فتح الملف
CheckBoxShowHints=تلميحات المعرض
CheckBoxShowKeyState=اظهر حالة المفتاح
CheckBoxShowLineCount:t=Translation needed
CheckBoxShowLineCount=Show line count
CheckBoxShowMacro=عرض المختصر
CheckBoxShowModified=اظهر التعديل
CheckBoxShowSelectionInfo=اظهار معلومات التحديد
CheckBoxShowSizeGrip=اظهار قبضة الحجم
CheckBoxVisible=مرئي
GroupBoxFont=الخط
GroupBoxFontSize=حجم الخط
RadioButtonFontCustom=مخصص
RadioButtonFontDefault=افتراضي
RadioButtonFontSizeCustom=مخصص
RadioButtonFontSizeDefault=افتراضي

[OptionsTitleBarFrame]
CheckBoxMagnifier=اظهار المكبر
CheckBoxShowApplicationName=إظهار اسم التطبيق
CheckBoxShowColorTheme=اظهار سمة اللون
CheckBoxShowEncoding=اظهار الترميز
CheckBoxShowFavourite=إظهار المفضلة
CheckBoxShowFileList=اظهار قائمة الملفات
CheckBoxShowFilename=اظهار اسم الملف
CheckBoxShowHighlighter=اظهار قلم تمييز
CheckBoxShowIcon=اظهار الايقونة
CheckBoxShowMenu=قائمة العرض
CheckBoxUseSystemStyle=استخدم نمط النظام
GroupBoxFont=الخط
GroupBoxFontSize=حجم الخط
RadioButtonFontCustom=مخصص
RadioButtonFontDefault=افتراضي
RadioButtonFontSizeCustom=مخصص
RadioButtonFontSizeDefault=افتراضي

[OptionsToolbarFrame]
ActionAddDivider:h=اضافة مقسم
ActionAddDivider=اضافة مقسما
ActionAddButton:h=اضافة مادة
ActionAddButton=اضافة مادة
ActionDelete:h=حذف
ActionDelete=حذف
ActionMoveDown:h=حرك المادة المحدد للاسفل
ActionMoveDown=تحريك للاسفل
ActionMoveUp:h=حرك المادة المحدد للاعلى
ActionMoveUp=تحريك للاعلى
ActionReset:h=استعادة مواد القائمة
ActionReset=استعادة
VirtualDrawTree:0=مواد القائمة
VirtualDrawTree:h=استخدم السحب والاسقاط لتحريك مواد القائمة. اضغط الزر الايمن لادخال وحذف المواد.

[OptionsToolbarOptionsFrame]
GroupBoxBackground=خلفية
GroupBoxIcons=الرموز
RadioButtonBackgroundHigh=متوسط
RadioButtonBackgroundLow=منخفض
RadioButtonBackgroundTransparent=شفاف
RadioButtonLargeIcons=كبير
RadioButtonSmallIcons=صغير
SpinEditMarginTop=الهامش العلوي

[OptionsMenuBarItemsDialog]
Caption=اختر مواد
VirtualDrawTreeAddItems:0=مواد القائمة

[OptionsToolbarItemsDialog]
Caption=اختر مواد
VirtualDrawTreeAddItems:0=مواد القائمة

[PrintPreviewForm]
ActionColors:h=تثبيت الالوان
ActionColors=الالوان
ActionExit:h=خروج معاينة الطباعة
ActionExit=خروج
ActionFirst:h=اولا|اذهب الى الصفحة الرئيسية
ActionFirst=الاول
ActionHighlight:h=تثبيت البارز
ActionHighlight=تمييز
ActionLast:h=اخرا|اذهب الى اخر الفحة
ActionLast=الاخير
ActionLineNumbers:h=تثبيت رقم الخط
ActionLineNumbers=رقم الخط
ActionNext:h=التالي|اذهب الى الصفحة التالية
ActionNext=&التالي
ActionPrevious:h=السابق|اذهب الى الصفحة السابقة
ActionPrevious=&السابق
ActionPrint:h=طبع|اطبع المستند
ActionPrint=طباعة
ActionWordWrap:h=تثبيت التواء الكلمة
ActionWordWrap=التواء الكلمة
ActionZoom:h=كبر|تكبير وتصغير
ActionZoom=تكبير/تصغير
ActionZoomIn:h=تكبير
ActionZoomIn=تكبير
ActionZoomOut:h=تصغير
ActionZoomOut=تصغير
Caption=معاينة الطباعة

[ReplaceDialog]
ActionClose=&اغلاق
ActionFindNext=&اوجد التالي
ActionReplace=استبدال
ActionReplaceAll=&استبدال الكل
ActionSearchEngine=حدد محرك البحث
Caption=استبدال
CheckBoxMatchCase=حالة الاحرف
CheckBoxPromptOnReplace=اشر على الاستبدال
CheckBoxSelectedOnly=المحدد فقط
CheckBoxWholeWords=الكلمة الكاملة فقط
ComboBoxSearchFor=ابحث عن
GroupBoxDirection=اتجاه
GroupBoxOptions=اختيارات
GroupBoxOrigin=الاصل
GroupBoxReplaceIn=استبدال في
RadioButtonActiveFile=الملف الكامل
RadioButtonAllOpenFiles=كل الملفات المفتوحة
RadioButtonDeleteLine=حذف الخط
RadioButtonDirectionBackward=الى الوراء
RadioButtonDirectionForward=الى الامام
RadioButtonEntireScope=نطاق كامل
RadioButtonOriginFromCursor=من المؤشر
RadioButtonReplaceWith=استبدال مع

[SearchForFilesForm]
Caption=بحث عن ملفات
PanelSearchingFiles=يتم البحث عن ملفات...

[ShortcutsForm]
Caption=اختصارات
VirtualDrawTree:0=الاختصار
VirtualDrawTree:1=الشرح
VirtualDrawTree:2=المعلومة

[OptionsSkinFrame]
CheckBoxActive=الترجمة المطلوبة
CheckBoxExtendedBordersEnabled=مفعل
CheckBoxExtendedBordersFull=ممتلئ
ComboBoxOptimizingPriority=تحسين الاولوية
GroupBoxColorization=التلوين
GroupBoxExtendedBorders=وضع امتداد الحدود
LabelBrightness=السطوع
LabelHueOffset=تعديل الشكل
LabelSaturation=الاشباع
LabelTransparency=الشفافيه
SkinSelector=ختر نموذجا

[OptionsSkinButtonsFrame]
CheckBoxShowButtonFocusRect=اظهار زر التركيز على المستقيم
CheckBoxUseButtonColors=استخدم الوان الزر

[OptionsSkinEffectsFrame]
CheckBoxAllowAeroBlurring=اسمح بالتعتيم الهوائي
CheckBoxAllowAnimation=السماح للرسوم المتحركة
CheckBoxAllowGlowing=السماج بالتوهج
CheckBoxAllowOuterEffects=السماح بالتاثيرات الخارجية
CheckBoxBlendOnMove=مزج الشكل عند التحرك

[OptionsSkinFontFrame]
RadioButtonFontCustom=مخصص
RadioButtonFontDefault=افتراضي
RadioButtonFontFromSkin=من الجلد

[OptionsSkinHintsFrame]
CheckBoxHintAnimated=المتحركه
ComboBoxHintStyle=اسلوب
SpinEditShowInterval=إظهار الفاصل الزمني (مللي ثانية)
SpinEditHideInterval=إخفاء الفاصل الزمني (مللي ثانية)

[OptionsSkinScrollBarsFrame]
CheckBoxArrowButtonsDefaultSize=الحجم الافتراضي
CheckBoxArrowButtonsVisible=مرئيه
CheckBoxScrollWidthDefaultSize=الحجم الافتراضي
GroupBoxArrowButtons=أزرار الأسهم
GroupBoxScrollBar=شريط التمرير
SpinEditArrowButtonsSize=حجم
SpinEditScrollWidthSize=حجم

[OptionsSkinStylesFrame]
CheckBoxDirectory:t=Translation needed
CheckBoxDirectory=Directory
CheckBoxFiles:t=Translation needed
CheckBoxFiles=Files
CheckBoxMenuBar:t=Translation needed
CheckBoxMenuBar=Menu bar
CheckBoxOutput:t=Translation needed
CheckBoxOutput=Output
CheckBoxUseCardGroupBoxStyle=استخدم نمط صندوق مجموعة البطاقات
ComboBoxArrowStyle=نمط السهم
GroupBoxSimplePageControl:t=Translation needed
GroupBoxSimplePageControl=Simple page control

[TabsSelectDialog]
Caption=حدد التبويب
VirtualDrawTree:0=تبويب

[CharacterMapForm]
Caption=لوحة الرموز المشفرة

[WarningMessage]
FileAccessError=الملف %s خطا الوصول.

[SaveChangesDialog]
Caption=Save changed files
VirtualDrawTree:0=File
VirtualDrawTree:1=Path

[ConnectDialog]
Caption=اتصال
EditPassword=كلمة السر

[UploadDialog]
Caption=رفع
EditFilename=اسم الملف
EditPath=مسار

[NewFolderDialog]
Caption=مجلد جديديد
EditPath=مسار

[DirectoryTabSFTPDialog]
Caption=اتصال SFTP
CheckBoxSavePassword=حفظ كلمة السر
CheckBoxShowOutput=إظهار الإخراج
EditPassword=كلمة السر
EditPort=منفذ
EditPrivateKeyFile=ملف مفتاح خاص
EditRootDirectory=دليل الجذر
EditServer=خادم
EditTabName=اسم علامة التبويب
EditUsername=اسم المستخدم